/* automatically generated by rust-bindgen 0.60.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const _CRT_INTERNAL_STDIO_SYMBOL_PREFIX: &[u8; 1usize] = b"\0";
pub const _CRT_INTERNAL_PRINTF_LEGACY_VSPRINTF_NULL_TERMINATION: u32 = 1;
pub const _CRT_INTERNAL_PRINTF_STANDARD_SNPRINTF_BEHAVIOR: u32 = 2;
pub const _CRT_INTERNAL_PRINTF_LEGACY_WIDE_SPECIFIERS: u32 = 4;
pub const _CRT_INTERNAL_PRINTF_LEGACY_MSVCRT_COMPATIBILITY: u32 = 8;
pub const _CRT_INTERNAL_PRINTF_LEGACY_THREE_DIGIT_EXPONENTS: u32 = 16;
pub const _CRT_INTERNAL_PRINTF_STANDARD_ROUNDING: u32 = 32;
pub const _CRT_INTERNAL_SCANF_SECURECRT: u32 = 1;
pub const _CRT_INTERNAL_SCANF_LEGACY_WIDE_SPECIFIERS: u32 = 2;
pub const _CRT_INTERNAL_SCANF_LEGACY_MSVCRT_COMPATIBILITY: u32 = 4;
pub const BUFSIZ: u32 = 512;
pub const _NSTREAM_: u32 = 512;
pub const _IOB_ENTRIES: u32 = 3;
pub const EOF: i32 = -1;
pub const _IOFBF: u32 = 0;
pub const _IOLBF: u32 = 64;
pub const _IONBF: u32 = 4;
pub const L_tmpnam: u32 = 260;
pub const L_tmpnam_s: u32 = 260;
pub const SEEK_CUR: u32 = 1;
pub const SEEK_END: u32 = 2;
pub const SEEK_SET: u32 = 0;
pub const FILENAME_MAX: u32 = 260;
pub const FOPEN_MAX: u32 = 20;
pub const _SYS_OPEN: u32 = 20;
pub const TMP_MAX: u32 = 2147483647;
pub const TMP_MAX_S: u32 = 2147483647;
pub const _TMP_MAX_S: u32 = 2147483647;
pub const SYS_OPEN: u32 = 20;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const __GNUC_VA_LIST: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const IMGUI_HAS_DOCK: u32 = 1;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type size_t = ::std::os::raw::c_ulonglong;
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize);
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn();
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    );
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    fn test_field__locale_pctype() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_data_public>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_data_public),
                "::",
                stringify!(_locale_pctype)
            )
        );
    }
    test_field__locale_pctype();
    fn test_field__locale_mb_cur_max() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_data_public>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_data_public),
                "::",
                stringify!(_locale_mb_cur_max)
            )
        );
    }
    test_field__locale_mb_cur_max();
    fn test_field__locale_lc_codepage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_data_public>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_data_public),
                "::",
                stringify!(_locale_lc_codepage)
            )
        );
    }
    test_field__locale_lc_codepage();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    fn test_field_locinfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_pointers>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_pointers),
                "::",
                stringify!(locinfo)
            )
        );
    }
    test_field_locinfo();
    fn test_field_mbcinfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_pointers>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_pointers),
                "::",
                stringify!(mbcinfo)
            )
        );
    }
    test_field_mbcinfo();
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    fn test_field__Wchar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_Mbstatet>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_Mbstatet),
                "::",
                stringify!(_Wchar)
            )
        );
    }
    test_field__Wchar();
    fn test_field__Byte() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_Mbstatet>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_Mbstatet),
                "::",
                stringify!(_Byte)
            )
        );
    }
    test_field__Byte();
    fn test_field__State() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_Mbstatet>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(_Mbstatet),
                "::",
                stringify!(_State)
            )
        );
    }
    test_field__State();
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = size_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _iobuf {
    pub _Placeholder: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__iobuf() {
    assert_eq!(
        ::std::mem::size_of::<_iobuf>(),
        8usize,
        concat!("Size of: ", stringify!(_iobuf))
    );
    assert_eq!(
        ::std::mem::align_of::<_iobuf>(),
        8usize,
        concat!("Alignment of ", stringify!(_iobuf))
    );
    fn test_field__Placeholder() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_iobuf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Placeholder) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_iobuf),
                "::",
                stringify!(_Placeholder)
            )
        );
    }
    test_field__Placeholder();
}
pub type FILE = _iobuf;
extern "C" {
    pub fn __acrt_iob_func(_Ix: ::std::os::raw::c_uint) -> *mut FILE;
}
extern "C" {
    pub fn fgetwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fgetwchar() -> wint_t;
}
extern "C" {
    pub fn fputwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwchar(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn getwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn getwchar() -> wint_t;
}
extern "C" {
    pub fn fgetws(
        _Buffer: *mut wchar_t,
        _BufferCount: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn fputws(_Buffer: *const wchar_t, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getws_s(_Buffer: *mut wchar_t, _BufferCount: size_t) -> *mut wchar_t;
}
extern "C" {
    pub fn putwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn putwchar(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn _putws(_Buffer: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetwc(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _wfdopen(_FileHandle: ::std::os::raw::c_int, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen(_FileName: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wfreopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _wfreopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn _wfsopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _ShFlag: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _wperror(_ErrorMessage: *const wchar_t);
}
extern "C" {
    pub fn _wpopen(_Command: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wremove(_FileName: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtempnam(_Directory: *const wchar_t, _FilePrefix: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wtmpnam_s(_Buffer: *mut wchar_t, _BufferCount: size_t) -> errno_t;
}
extern "C" {
    pub fn _wtmpnam(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _fgetwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _getwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _putwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _ungetwc_nolock(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn __stdio_common_vfwprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: size_t,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: size_t,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsnwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: size_t,
        _MaxCount: size_t,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: size_t,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *const wchar_t,
        _BufferCount: size_t,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
pub type fpos_t = ::std::os::raw::c_longlong;
extern "C" {
    pub fn _get_stream_buffer_pointers(
        _Stream: *mut FILE,
        _Base: *mut *mut *mut ::std::os::raw::c_char,
        _Pointer: *mut *mut *mut ::std::os::raw::c_char,
        _Count: *mut *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn clearerr_s(_Stream: *mut FILE) -> errno_t;
}
extern "C" {
    pub fn fopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn fread_s(
        _Buffer: *mut ::std::os::raw::c_void,
        _BufferSize: size_t,
        _ElementSize: size_t,
        _ElementCount: size_t,
        _Stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn freopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn gets_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _Size: rsize_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpfile_s(_Stream: *mut *mut FILE) -> errno_t;
}
extern "C" {
    pub fn tmpnam_s(_Buffer: *mut ::std::os::raw::c_char, _Size: rsize_t) -> errno_t;
}
extern "C" {
    pub fn clearerr(_Stream: *mut FILE);
}
extern "C" {
    pub fn fclose(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fcloseall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fdopen(
        _FileHandle: ::std::os::raw::c_int,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn feof(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fgetchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetpos(_Stream: *mut FILE, _Position: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        _Buffer: *mut ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _fileno(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _flushall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fputc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fputchar(_Character: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputs(
        _Buffer: *const ::std::os::raw::c_char,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        _Buffer: *mut ::std::os::raw::c_void,
        _ElementSize: ::std::os::raw::c_ulonglong,
        _ElementCount: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn freopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _Stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fsopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _ShFlag: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fsetpos(_Stream: *mut FILE, _Position: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseek(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_long,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fseeki64(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_longlong,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(_Stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _ftelli64(_Stream: *mut FILE) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fwrite(
        _Buffer: *const ::std::os::raw::c_void,
        _ElementSize: ::std::os::raw::c_ulonglong,
        _ElementCount: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn getc(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getmaxstdio() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getw(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(_ErrorMessage: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn _pclose(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _popen(
        _Command: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn putc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(_Character: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(_Buffer: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putw(_Word: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        _OldFileName: *const ::std::os::raw::c_char,
        _NewFileName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _unlink(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlink(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rewind(_Stream: *mut FILE);
}
extern "C" {
    pub fn _rmtmp() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(_Stream: *mut FILE, _Buffer: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn _setmaxstdio(_Maximum: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setvbuf(
        _Stream: *mut FILE,
        _Buffer: *mut ::std::os::raw::c_char,
        _Mode: ::std::os::raw::c_int,
        _Size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _tempnam(
        _DirectoryName: *const ::std::os::raw::c_char,
        _FilePrefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(_Buffer: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ungetc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _lock_file(_Stream: *mut FILE);
}
extern "C" {
    pub fn _unlock_file(_Stream: *mut FILE);
}
extern "C" {
    pub fn _fclose_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fflush_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fgetc_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fputc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fread_nolock(
        _Buffer: *mut ::std::os::raw::c_void,
        _ElementSize: size_t,
        _ElementCount: size_t,
        _Stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn _fread_nolock_s(
        _Buffer: *mut ::std::os::raw::c_void,
        _BufferSize: size_t,
        _ElementSize: size_t,
        _ElementCount: size_t,
        _Stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn _fseek_nolock(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_long,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fseeki64_nolock(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_longlong,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _ftell_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _ftelli64_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _fwrite_nolock(
        _Buffer: *const ::std::os::raw::c_void,
        _ElementSize: size_t,
        _ElementCount: size_t,
        _Stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn _getc_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _ungetc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __p__commode() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_printf_count_output(_Value: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _get_printf_count_output() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _Arglist: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: size_t,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: size_t,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsnprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: size_t,
        _MaxCount: size_t,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: size_t,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *const ::std::os::raw::c_char,
        _BufferCount: size_t,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tempnam(
        _Directory: *const ::std::os::raw::c_char,
        _FilePrefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcloseall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fdopen(
        _FileHandle: ::std::os::raw::c_int,
        _Format: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fgetchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flushall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputchar(_Ch: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(_Ch: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rmtmp() -> ::std::os::raw::c_int;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type __gnuc_va_list = __builtin_va_list;
pub type ImU64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiDockRequest {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiDockNodeSettings {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiTableColumnsSettings {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_const_charPtr {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ImVector_const_charPtr() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_const_charPtr>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_const_charPtr))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_const_charPtr>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_const_charPtr))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_const_charPtr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_const_charPtr),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_const_charPtr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_const_charPtr),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_const_charPtr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_const_charPtr),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
pub type ImGuiCol = ::std::os::raw::c_int;
pub type ImGuiCond = ::std::os::raw::c_int;
pub type ImGuiDataType = ::std::os::raw::c_int;
pub type ImGuiDir = ::std::os::raw::c_int;
pub type ImGuiKey = ::std::os::raw::c_int;
pub type ImGuiNavInput = ::std::os::raw::c_int;
pub type ImGuiMouseButton = ::std::os::raw::c_int;
pub type ImGuiMouseCursor = ::std::os::raw::c_int;
pub type ImGuiSortDirection = ::std::os::raw::c_int;
pub type ImGuiStyleVar = ::std::os::raw::c_int;
pub type ImGuiTableBgTarget = ::std::os::raw::c_int;
pub type ImDrawFlags = ::std::os::raw::c_int;
pub type ImDrawListFlags = ::std::os::raw::c_int;
pub type ImFontAtlasFlags = ::std::os::raw::c_int;
pub type ImGuiBackendFlags = ::std::os::raw::c_int;
pub type ImGuiButtonFlags = ::std::os::raw::c_int;
pub type ImGuiColorEditFlags = ::std::os::raw::c_int;
pub type ImGuiConfigFlags = ::std::os::raw::c_int;
pub type ImGuiComboFlags = ::std::os::raw::c_int;
pub type ImGuiDockNodeFlags = ::std::os::raw::c_int;
pub type ImGuiDragDropFlags = ::std::os::raw::c_int;
pub type ImGuiFocusedFlags = ::std::os::raw::c_int;
pub type ImGuiHoveredFlags = ::std::os::raw::c_int;
pub type ImGuiInputTextFlags = ::std::os::raw::c_int;
pub type ImGuiModFlags = ::std::os::raw::c_int;
pub type ImGuiPopupFlags = ::std::os::raw::c_int;
pub type ImGuiSelectableFlags = ::std::os::raw::c_int;
pub type ImGuiSliderFlags = ::std::os::raw::c_int;
pub type ImGuiTabBarFlags = ::std::os::raw::c_int;
pub type ImGuiTabItemFlags = ::std::os::raw::c_int;
pub type ImGuiTableFlags = ::std::os::raw::c_int;
pub type ImGuiTableColumnFlags = ::std::os::raw::c_int;
pub type ImGuiTableRowFlags = ::std::os::raw::c_int;
pub type ImGuiTreeNodeFlags = ::std::os::raw::c_int;
pub type ImGuiViewportFlags = ::std::os::raw::c_int;
pub type ImGuiWindowFlags = ::std::os::raw::c_int;
pub type ImTextureID = *mut ::std::os::raw::c_void;
pub type ImDrawIdx = ::std::os::raw::c_ushort;
pub type ImGuiID = ::std::os::raw::c_uint;
pub type ImS8 = ::std::os::raw::c_schar;
pub type ImU8 = ::std::os::raw::c_uchar;
pub type ImS16 = ::std::os::raw::c_short;
pub type ImU16 = ::std::os::raw::c_ushort;
pub type ImS32 = ::std::os::raw::c_int;
pub type ImU32 = ::std::os::raw::c_uint;
pub type ImS64 = ::std::os::raw::c_longlong;
pub type ImWchar16 = ::std::os::raw::c_ushort;
pub type ImWchar32 = ::std::os::raw::c_uint;
pub type ImWchar = ImWchar16;
pub type ImGuiInputTextCallback = ::std::option::Option<
    unsafe extern "C" fn(data: *mut ImGuiInputTextCallbackData) -> ::std::os::raw::c_int,
>;
pub type ImGuiSizeCallback =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ImGuiSizeCallbackData)>;
pub type ImGuiMemAllocFunc = ::std::option::Option<
    unsafe extern "C" fn(
        sz: size_t,
        user_data: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type ImGuiMemFreeFunc = ::std::option::Option<
    unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void, user_data: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVec2 {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_ImVec2() {
    assert_eq!(
        ::std::mem::size_of::<ImVec2>(),
        8usize,
        concat!("Size of: ", stringify!(ImVec2))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVec2>(),
        4usize,
        concat!("Alignment of ", stringify!(ImVec2))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVec2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!("Offset of field: ", stringify!(ImVec2), "::", stringify!(x))
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVec2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!("Offset of field: ", stringify!(ImVec2), "::", stringify!(y))
        );
    }
    test_field_y();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVec4 {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[test]
fn bindgen_test_layout_ImVec4() {
    assert_eq!(
        ::std::mem::size_of::<ImVec4>(),
        16usize,
        concat!("Size of: ", stringify!(ImVec4))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVec4>(),
        4usize,
        concat!("Alignment of ", stringify!(ImVec4))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVec4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!("Offset of field: ", stringify!(ImVec4), "::", stringify!(x))
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVec4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!("Offset of field: ", stringify!(ImVec4), "::", stringify!(y))
        );
    }
    test_field_y();
    fn test_field_z() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVec4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize
            },
            8usize,
            concat!("Offset of field: ", stringify!(ImVec4), "::", stringify!(z))
        );
    }
    test_field_z();
    fn test_field_w() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVec4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize
            },
            12usize,
            concat!("Offset of field: ", stringify!(ImVec4), "::", stringify!(w))
        );
    }
    test_field_w();
}
pub const ImGuiWindowFlags__ImGuiWindowFlags_None: ImGuiWindowFlags_ = 0;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoTitleBar: ImGuiWindowFlags_ = 1;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoResize: ImGuiWindowFlags_ = 2;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoMove: ImGuiWindowFlags_ = 4;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoScrollbar: ImGuiWindowFlags_ = 8;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoScrollWithMouse: ImGuiWindowFlags_ = 16;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoCollapse: ImGuiWindowFlags_ = 32;
pub const ImGuiWindowFlags__ImGuiWindowFlags_AlwaysAutoResize: ImGuiWindowFlags_ = 64;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoBackground: ImGuiWindowFlags_ = 128;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoSavedSettings: ImGuiWindowFlags_ = 256;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoMouseInputs: ImGuiWindowFlags_ = 512;
pub const ImGuiWindowFlags__ImGuiWindowFlags_MenuBar: ImGuiWindowFlags_ = 1024;
pub const ImGuiWindowFlags__ImGuiWindowFlags_HorizontalScrollbar: ImGuiWindowFlags_ = 2048;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoFocusOnAppearing: ImGuiWindowFlags_ = 4096;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoBringToFrontOnFocus: ImGuiWindowFlags_ = 8192;
pub const ImGuiWindowFlags__ImGuiWindowFlags_AlwaysVerticalScrollbar: ImGuiWindowFlags_ = 16384;
pub const ImGuiWindowFlags__ImGuiWindowFlags_AlwaysHorizontalScrollbar: ImGuiWindowFlags_ = 32768;
pub const ImGuiWindowFlags__ImGuiWindowFlags_AlwaysUseWindowPadding: ImGuiWindowFlags_ = 65536;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoNavInputs: ImGuiWindowFlags_ = 262144;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoNavFocus: ImGuiWindowFlags_ = 524288;
pub const ImGuiWindowFlags__ImGuiWindowFlags_UnsavedDocument: ImGuiWindowFlags_ = 1048576;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoDocking: ImGuiWindowFlags_ = 2097152;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoNav: ImGuiWindowFlags_ = 786432;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoDecoration: ImGuiWindowFlags_ = 43;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NoInputs: ImGuiWindowFlags_ = 786944;
pub const ImGuiWindowFlags__ImGuiWindowFlags_NavFlattened: ImGuiWindowFlags_ = 8388608;
pub const ImGuiWindowFlags__ImGuiWindowFlags_ChildWindow: ImGuiWindowFlags_ = 16777216;
pub const ImGuiWindowFlags__ImGuiWindowFlags_Tooltip: ImGuiWindowFlags_ = 33554432;
pub const ImGuiWindowFlags__ImGuiWindowFlags_Popup: ImGuiWindowFlags_ = 67108864;
pub const ImGuiWindowFlags__ImGuiWindowFlags_Modal: ImGuiWindowFlags_ = 134217728;
pub const ImGuiWindowFlags__ImGuiWindowFlags_ChildMenu: ImGuiWindowFlags_ = 268435456;
pub const ImGuiWindowFlags__ImGuiWindowFlags_DockNodeHost: ImGuiWindowFlags_ = 536870912;
pub type ImGuiWindowFlags_ = ::std::os::raw::c_int;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_None: ImGuiInputTextFlags_ = 0;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CharsDecimal: ImGuiInputTextFlags_ = 1;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CharsHexadecimal: ImGuiInputTextFlags_ = 2;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CharsUppercase: ImGuiInputTextFlags_ = 4;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CharsNoBlank: ImGuiInputTextFlags_ = 8;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_AutoSelectAll: ImGuiInputTextFlags_ = 16;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_EnterReturnsTrue: ImGuiInputTextFlags_ = 32;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CallbackCompletion: ImGuiInputTextFlags_ = 64;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CallbackHistory: ImGuiInputTextFlags_ = 128;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CallbackAlways: ImGuiInputTextFlags_ = 256;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CallbackCharFilter: ImGuiInputTextFlags_ = 512;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_AllowTabInput: ImGuiInputTextFlags_ = 1024;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CtrlEnterForNewLine: ImGuiInputTextFlags_ = 2048;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_NoHorizontalScroll: ImGuiInputTextFlags_ = 4096;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_AlwaysOverwrite: ImGuiInputTextFlags_ = 8192;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_ReadOnly: ImGuiInputTextFlags_ = 16384;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_Password: ImGuiInputTextFlags_ = 32768;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_NoUndoRedo: ImGuiInputTextFlags_ = 65536;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CharsScientific: ImGuiInputTextFlags_ = 131072;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CallbackResize: ImGuiInputTextFlags_ = 262144;
pub const ImGuiInputTextFlags__ImGuiInputTextFlags_CallbackEdit: ImGuiInputTextFlags_ = 524288;
pub type ImGuiInputTextFlags_ = ::std::os::raw::c_int;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_None: ImGuiTreeNodeFlags_ = 0;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_Selected: ImGuiTreeNodeFlags_ = 1;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_Framed: ImGuiTreeNodeFlags_ = 2;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_AllowItemOverlap: ImGuiTreeNodeFlags_ = 4;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_NoTreePushOnOpen: ImGuiTreeNodeFlags_ = 8;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_NoAutoOpenOnLog: ImGuiTreeNodeFlags_ = 16;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_DefaultOpen: ImGuiTreeNodeFlags_ = 32;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_OpenOnDoubleClick: ImGuiTreeNodeFlags_ = 64;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_OpenOnArrow: ImGuiTreeNodeFlags_ = 128;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_Leaf: ImGuiTreeNodeFlags_ = 256;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_Bullet: ImGuiTreeNodeFlags_ = 512;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_FramePadding: ImGuiTreeNodeFlags_ = 1024;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_SpanAvailWidth: ImGuiTreeNodeFlags_ = 2048;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_SpanFullWidth: ImGuiTreeNodeFlags_ = 4096;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_NavLeftJumpsBackHere: ImGuiTreeNodeFlags_ = 8192;
pub const ImGuiTreeNodeFlags__ImGuiTreeNodeFlags_CollapsingHeader: ImGuiTreeNodeFlags_ = 26;
pub type ImGuiTreeNodeFlags_ = ::std::os::raw::c_int;
pub const ImGuiPopupFlags__ImGuiPopupFlags_None: ImGuiPopupFlags_ = 0;
pub const ImGuiPopupFlags__ImGuiPopupFlags_MouseButtonLeft: ImGuiPopupFlags_ = 0;
pub const ImGuiPopupFlags__ImGuiPopupFlags_MouseButtonRight: ImGuiPopupFlags_ = 1;
pub const ImGuiPopupFlags__ImGuiPopupFlags_MouseButtonMiddle: ImGuiPopupFlags_ = 2;
pub const ImGuiPopupFlags__ImGuiPopupFlags_MouseButtonMask_: ImGuiPopupFlags_ = 31;
pub const ImGuiPopupFlags__ImGuiPopupFlags_MouseButtonDefault_: ImGuiPopupFlags_ = 1;
pub const ImGuiPopupFlags__ImGuiPopupFlags_NoOpenOverExistingPopup: ImGuiPopupFlags_ = 32;
pub const ImGuiPopupFlags__ImGuiPopupFlags_NoOpenOverItems: ImGuiPopupFlags_ = 64;
pub const ImGuiPopupFlags__ImGuiPopupFlags_AnyPopupId: ImGuiPopupFlags_ = 128;
pub const ImGuiPopupFlags__ImGuiPopupFlags_AnyPopupLevel: ImGuiPopupFlags_ = 256;
pub const ImGuiPopupFlags__ImGuiPopupFlags_AnyPopup: ImGuiPopupFlags_ = 384;
pub type ImGuiPopupFlags_ = ::std::os::raw::c_int;
pub const ImGuiSelectableFlags__ImGuiSelectableFlags_None: ImGuiSelectableFlags_ = 0;
pub const ImGuiSelectableFlags__ImGuiSelectableFlags_DontClosePopups: ImGuiSelectableFlags_ = 1;
pub const ImGuiSelectableFlags__ImGuiSelectableFlags_SpanAllColumns: ImGuiSelectableFlags_ = 2;
pub const ImGuiSelectableFlags__ImGuiSelectableFlags_AllowDoubleClick: ImGuiSelectableFlags_ = 4;
pub const ImGuiSelectableFlags__ImGuiSelectableFlags_Disabled: ImGuiSelectableFlags_ = 8;
pub const ImGuiSelectableFlags__ImGuiSelectableFlags_AllowItemOverlap: ImGuiSelectableFlags_ = 16;
pub type ImGuiSelectableFlags_ = ::std::os::raw::c_int;
pub const ImGuiComboFlags__ImGuiComboFlags_None: ImGuiComboFlags_ = 0;
pub const ImGuiComboFlags__ImGuiComboFlags_PopupAlignLeft: ImGuiComboFlags_ = 1;
pub const ImGuiComboFlags__ImGuiComboFlags_HeightSmall: ImGuiComboFlags_ = 2;
pub const ImGuiComboFlags__ImGuiComboFlags_HeightRegular: ImGuiComboFlags_ = 4;
pub const ImGuiComboFlags__ImGuiComboFlags_HeightLarge: ImGuiComboFlags_ = 8;
pub const ImGuiComboFlags__ImGuiComboFlags_HeightLargest: ImGuiComboFlags_ = 16;
pub const ImGuiComboFlags__ImGuiComboFlags_NoArrowButton: ImGuiComboFlags_ = 32;
pub const ImGuiComboFlags__ImGuiComboFlags_NoPreview: ImGuiComboFlags_ = 64;
pub const ImGuiComboFlags__ImGuiComboFlags_HeightMask_: ImGuiComboFlags_ = 30;
pub type ImGuiComboFlags_ = ::std::os::raw::c_int;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_None: ImGuiTabBarFlags_ = 0;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_Reorderable: ImGuiTabBarFlags_ = 1;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_AutoSelectNewTabs: ImGuiTabBarFlags_ = 2;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_TabListPopupButton: ImGuiTabBarFlags_ = 4;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_NoCloseWithMiddleMouseButton: ImGuiTabBarFlags_ = 8;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_NoTabListScrollingButtons: ImGuiTabBarFlags_ = 16;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_NoTooltip: ImGuiTabBarFlags_ = 32;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_FittingPolicyResizeDown: ImGuiTabBarFlags_ = 64;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_FittingPolicyScroll: ImGuiTabBarFlags_ = 128;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_FittingPolicyMask_: ImGuiTabBarFlags_ = 192;
pub const ImGuiTabBarFlags__ImGuiTabBarFlags_FittingPolicyDefault_: ImGuiTabBarFlags_ = 64;
pub type ImGuiTabBarFlags_ = ::std::os::raw::c_int;
pub const ImGuiTabItemFlags__ImGuiTabItemFlags_None: ImGuiTabItemFlags_ = 0;
pub const ImGuiTabItemFlags__ImGuiTabItemFlags_UnsavedDocument: ImGuiTabItemFlags_ = 1;
pub const ImGuiTabItemFlags__ImGuiTabItemFlags_SetSelected: ImGuiTabItemFlags_ = 2;
pub const ImGuiTabItemFlags__ImGuiTabItemFlags_NoCloseWithMiddleMouseButton: ImGuiTabItemFlags_ = 4;
pub const ImGuiTabItemFlags__ImGuiTabItemFlags_NoPushId: ImGuiTabItemFlags_ = 8;
pub const ImGuiTabItemFlags__ImGuiTabItemFlags_NoTooltip: ImGuiTabItemFlags_ = 16;
pub const ImGuiTabItemFlags__ImGuiTabItemFlags_NoReorder: ImGuiTabItemFlags_ = 32;
pub const ImGuiTabItemFlags__ImGuiTabItemFlags_Leading: ImGuiTabItemFlags_ = 64;
pub const ImGuiTabItemFlags__ImGuiTabItemFlags_Trailing: ImGuiTabItemFlags_ = 128;
pub type ImGuiTabItemFlags_ = ::std::os::raw::c_int;
pub const ImGuiTableFlags__ImGuiTableFlags_None: ImGuiTableFlags_ = 0;
pub const ImGuiTableFlags__ImGuiTableFlags_Resizable: ImGuiTableFlags_ = 1;
pub const ImGuiTableFlags__ImGuiTableFlags_Reorderable: ImGuiTableFlags_ = 2;
pub const ImGuiTableFlags__ImGuiTableFlags_Hideable: ImGuiTableFlags_ = 4;
pub const ImGuiTableFlags__ImGuiTableFlags_Sortable: ImGuiTableFlags_ = 8;
pub const ImGuiTableFlags__ImGuiTableFlags_NoSavedSettings: ImGuiTableFlags_ = 16;
pub const ImGuiTableFlags__ImGuiTableFlags_ContextMenuInBody: ImGuiTableFlags_ = 32;
pub const ImGuiTableFlags__ImGuiTableFlags_RowBg: ImGuiTableFlags_ = 64;
pub const ImGuiTableFlags__ImGuiTableFlags_BordersInnerH: ImGuiTableFlags_ = 128;
pub const ImGuiTableFlags__ImGuiTableFlags_BordersOuterH: ImGuiTableFlags_ = 256;
pub const ImGuiTableFlags__ImGuiTableFlags_BordersInnerV: ImGuiTableFlags_ = 512;
pub const ImGuiTableFlags__ImGuiTableFlags_BordersOuterV: ImGuiTableFlags_ = 1024;
pub const ImGuiTableFlags__ImGuiTableFlags_BordersH: ImGuiTableFlags_ = 384;
pub const ImGuiTableFlags__ImGuiTableFlags_BordersV: ImGuiTableFlags_ = 1536;
pub const ImGuiTableFlags__ImGuiTableFlags_BordersInner: ImGuiTableFlags_ = 640;
pub const ImGuiTableFlags__ImGuiTableFlags_BordersOuter: ImGuiTableFlags_ = 1280;
pub const ImGuiTableFlags__ImGuiTableFlags_Borders: ImGuiTableFlags_ = 1920;
pub const ImGuiTableFlags__ImGuiTableFlags_NoBordersInBody: ImGuiTableFlags_ = 2048;
pub const ImGuiTableFlags__ImGuiTableFlags_NoBordersInBodyUntilResize: ImGuiTableFlags_ = 4096;
pub const ImGuiTableFlags__ImGuiTableFlags_SizingFixedFit: ImGuiTableFlags_ = 8192;
pub const ImGuiTableFlags__ImGuiTableFlags_SizingFixedSame: ImGuiTableFlags_ = 16384;
pub const ImGuiTableFlags__ImGuiTableFlags_SizingStretchProp: ImGuiTableFlags_ = 24576;
pub const ImGuiTableFlags__ImGuiTableFlags_SizingStretchSame: ImGuiTableFlags_ = 32768;
pub const ImGuiTableFlags__ImGuiTableFlags_NoHostExtendX: ImGuiTableFlags_ = 65536;
pub const ImGuiTableFlags__ImGuiTableFlags_NoHostExtendY: ImGuiTableFlags_ = 131072;
pub const ImGuiTableFlags__ImGuiTableFlags_NoKeepColumnsVisible: ImGuiTableFlags_ = 262144;
pub const ImGuiTableFlags__ImGuiTableFlags_PreciseWidths: ImGuiTableFlags_ = 524288;
pub const ImGuiTableFlags__ImGuiTableFlags_NoClip: ImGuiTableFlags_ = 1048576;
pub const ImGuiTableFlags__ImGuiTableFlags_PadOuterX: ImGuiTableFlags_ = 2097152;
pub const ImGuiTableFlags__ImGuiTableFlags_NoPadOuterX: ImGuiTableFlags_ = 4194304;
pub const ImGuiTableFlags__ImGuiTableFlags_NoPadInnerX: ImGuiTableFlags_ = 8388608;
pub const ImGuiTableFlags__ImGuiTableFlags_ScrollX: ImGuiTableFlags_ = 16777216;
pub const ImGuiTableFlags__ImGuiTableFlags_ScrollY: ImGuiTableFlags_ = 33554432;
pub const ImGuiTableFlags__ImGuiTableFlags_SortMulti: ImGuiTableFlags_ = 67108864;
pub const ImGuiTableFlags__ImGuiTableFlags_SortTristate: ImGuiTableFlags_ = 134217728;
pub const ImGuiTableFlags__ImGuiTableFlags_SizingMask_: ImGuiTableFlags_ = 57344;
pub type ImGuiTableFlags_ = ::std::os::raw::c_int;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_None: ImGuiTableColumnFlags_ = 0;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_Disabled: ImGuiTableColumnFlags_ = 1;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_DefaultHide: ImGuiTableColumnFlags_ = 2;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_DefaultSort: ImGuiTableColumnFlags_ = 4;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_WidthStretch: ImGuiTableColumnFlags_ = 8;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_WidthFixed: ImGuiTableColumnFlags_ = 16;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoResize: ImGuiTableColumnFlags_ = 32;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoReorder: ImGuiTableColumnFlags_ = 64;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoHide: ImGuiTableColumnFlags_ = 128;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoClip: ImGuiTableColumnFlags_ = 256;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoSort: ImGuiTableColumnFlags_ = 512;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoSortAscending: ImGuiTableColumnFlags_ =
    1024;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoSortDescending: ImGuiTableColumnFlags_ =
    2048;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoHeaderLabel: ImGuiTableColumnFlags_ = 4096;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoHeaderWidth: ImGuiTableColumnFlags_ = 8192;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_PreferSortAscending: ImGuiTableColumnFlags_ =
    16384;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_PreferSortDescending:
    ImGuiTableColumnFlags_ = 32768;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_IndentEnable: ImGuiTableColumnFlags_ = 65536;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_IndentDisable: ImGuiTableColumnFlags_ =
    131072;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_IsEnabled: ImGuiTableColumnFlags_ = 16777216;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_IsVisible: ImGuiTableColumnFlags_ = 33554432;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_IsSorted: ImGuiTableColumnFlags_ = 67108864;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_IsHovered: ImGuiTableColumnFlags_ =
    134217728;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_WidthMask_: ImGuiTableColumnFlags_ = 24;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_IndentMask_: ImGuiTableColumnFlags_ = 196608;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_StatusMask_: ImGuiTableColumnFlags_ =
    251658240;
pub const ImGuiTableColumnFlags__ImGuiTableColumnFlags_NoDirectResize_: ImGuiTableColumnFlags_ =
    1073741824;
pub type ImGuiTableColumnFlags_ = ::std::os::raw::c_int;
pub const ImGuiTableRowFlags__ImGuiTableRowFlags_None: ImGuiTableRowFlags_ = 0;
pub const ImGuiTableRowFlags__ImGuiTableRowFlags_Headers: ImGuiTableRowFlags_ = 1;
pub type ImGuiTableRowFlags_ = ::std::os::raw::c_int;
pub const ImGuiTableBgTarget__ImGuiTableBgTarget_None: ImGuiTableBgTarget_ = 0;
pub const ImGuiTableBgTarget__ImGuiTableBgTarget_RowBg0: ImGuiTableBgTarget_ = 1;
pub const ImGuiTableBgTarget__ImGuiTableBgTarget_RowBg1: ImGuiTableBgTarget_ = 2;
pub const ImGuiTableBgTarget__ImGuiTableBgTarget_CellBg: ImGuiTableBgTarget_ = 3;
pub type ImGuiTableBgTarget_ = ::std::os::raw::c_int;
pub const ImGuiFocusedFlags__ImGuiFocusedFlags_None: ImGuiFocusedFlags_ = 0;
pub const ImGuiFocusedFlags__ImGuiFocusedFlags_ChildWindows: ImGuiFocusedFlags_ = 1;
pub const ImGuiFocusedFlags__ImGuiFocusedFlags_RootWindow: ImGuiFocusedFlags_ = 2;
pub const ImGuiFocusedFlags__ImGuiFocusedFlags_AnyWindow: ImGuiFocusedFlags_ = 4;
pub const ImGuiFocusedFlags__ImGuiFocusedFlags_NoPopupHierarchy: ImGuiFocusedFlags_ = 8;
pub const ImGuiFocusedFlags__ImGuiFocusedFlags_DockHierarchy: ImGuiFocusedFlags_ = 16;
pub const ImGuiFocusedFlags__ImGuiFocusedFlags_RootAndChildWindows: ImGuiFocusedFlags_ = 3;
pub type ImGuiFocusedFlags_ = ::std::os::raw::c_int;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_None: ImGuiHoveredFlags_ = 0;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_ChildWindows: ImGuiHoveredFlags_ = 1;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_RootWindow: ImGuiHoveredFlags_ = 2;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_AnyWindow: ImGuiHoveredFlags_ = 4;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_NoPopupHierarchy: ImGuiHoveredFlags_ = 8;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_DockHierarchy: ImGuiHoveredFlags_ = 16;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_AllowWhenBlockedByPopup: ImGuiHoveredFlags_ = 32;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_AllowWhenBlockedByActiveItem: ImGuiHoveredFlags_ =
    128;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_AllowWhenOverlapped: ImGuiHoveredFlags_ = 256;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_AllowWhenDisabled: ImGuiHoveredFlags_ = 512;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_NoNavOverride: ImGuiHoveredFlags_ = 1024;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_RectOnly: ImGuiHoveredFlags_ = 416;
pub const ImGuiHoveredFlags__ImGuiHoveredFlags_RootAndChildWindows: ImGuiHoveredFlags_ = 3;
pub type ImGuiHoveredFlags_ = ::std::os::raw::c_int;
pub const ImGuiDockNodeFlags__ImGuiDockNodeFlags_None: ImGuiDockNodeFlags_ = 0;
pub const ImGuiDockNodeFlags__ImGuiDockNodeFlags_KeepAliveOnly: ImGuiDockNodeFlags_ = 1;
pub const ImGuiDockNodeFlags__ImGuiDockNodeFlags_NoDockingInCentralNode: ImGuiDockNodeFlags_ = 4;
pub const ImGuiDockNodeFlags__ImGuiDockNodeFlags_PassthruCentralNode: ImGuiDockNodeFlags_ = 8;
pub const ImGuiDockNodeFlags__ImGuiDockNodeFlags_NoSplit: ImGuiDockNodeFlags_ = 16;
pub const ImGuiDockNodeFlags__ImGuiDockNodeFlags_NoResize: ImGuiDockNodeFlags_ = 32;
pub const ImGuiDockNodeFlags__ImGuiDockNodeFlags_AutoHideTabBar: ImGuiDockNodeFlags_ = 64;
pub type ImGuiDockNodeFlags_ = ::std::os::raw::c_int;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_None: ImGuiDragDropFlags_ = 0;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_SourceNoPreviewTooltip: ImGuiDragDropFlags_ = 1;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_SourceNoDisableHover: ImGuiDragDropFlags_ = 2;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_SourceNoHoldToOpenOthers: ImGuiDragDropFlags_ = 4;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_SourceAllowNullID: ImGuiDragDropFlags_ = 8;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_SourceExtern: ImGuiDragDropFlags_ = 16;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_SourceAutoExpirePayload: ImGuiDragDropFlags_ = 32;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_AcceptBeforeDelivery: ImGuiDragDropFlags_ = 1024;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_AcceptNoDrawDefaultRect: ImGuiDragDropFlags_ =
    2048;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_AcceptNoPreviewTooltip: ImGuiDragDropFlags_ = 4096;
pub const ImGuiDragDropFlags__ImGuiDragDropFlags_AcceptPeekOnly: ImGuiDragDropFlags_ = 3072;
pub type ImGuiDragDropFlags_ = ::std::os::raw::c_int;
pub const ImGuiDataType__ImGuiDataType_S8: ImGuiDataType_ = 0;
pub const ImGuiDataType__ImGuiDataType_U8: ImGuiDataType_ = 1;
pub const ImGuiDataType__ImGuiDataType_S16: ImGuiDataType_ = 2;
pub const ImGuiDataType__ImGuiDataType_U16: ImGuiDataType_ = 3;
pub const ImGuiDataType__ImGuiDataType_S32: ImGuiDataType_ = 4;
pub const ImGuiDataType__ImGuiDataType_U32: ImGuiDataType_ = 5;
pub const ImGuiDataType__ImGuiDataType_S64: ImGuiDataType_ = 6;
pub const ImGuiDataType__ImGuiDataType_U64: ImGuiDataType_ = 7;
pub const ImGuiDataType__ImGuiDataType_Float: ImGuiDataType_ = 8;
pub const ImGuiDataType__ImGuiDataType_Double: ImGuiDataType_ = 9;
pub const ImGuiDataType__ImGuiDataType_COUNT: ImGuiDataType_ = 10;
pub type ImGuiDataType_ = ::std::os::raw::c_int;
pub const ImGuiDir__ImGuiDir_None: ImGuiDir_ = -1;
pub const ImGuiDir__ImGuiDir_Left: ImGuiDir_ = 0;
pub const ImGuiDir__ImGuiDir_Right: ImGuiDir_ = 1;
pub const ImGuiDir__ImGuiDir_Up: ImGuiDir_ = 2;
pub const ImGuiDir__ImGuiDir_Down: ImGuiDir_ = 3;
pub const ImGuiDir__ImGuiDir_COUNT: ImGuiDir_ = 4;
pub type ImGuiDir_ = ::std::os::raw::c_int;
pub const ImGuiSortDirection__ImGuiSortDirection_None: ImGuiSortDirection_ = 0;
pub const ImGuiSortDirection__ImGuiSortDirection_Ascending: ImGuiSortDirection_ = 1;
pub const ImGuiSortDirection__ImGuiSortDirection_Descending: ImGuiSortDirection_ = 2;
pub type ImGuiSortDirection_ = ::std::os::raw::c_int;
pub const ImGuiKey__ImGuiKey_None: ImGuiKey_ = 0;
pub const ImGuiKey__ImGuiKey_Tab: ImGuiKey_ = 512;
pub const ImGuiKey__ImGuiKey_LeftArrow: ImGuiKey_ = 513;
pub const ImGuiKey__ImGuiKey_RightArrow: ImGuiKey_ = 514;
pub const ImGuiKey__ImGuiKey_UpArrow: ImGuiKey_ = 515;
pub const ImGuiKey__ImGuiKey_DownArrow: ImGuiKey_ = 516;
pub const ImGuiKey__ImGuiKey_PageUp: ImGuiKey_ = 517;
pub const ImGuiKey__ImGuiKey_PageDown: ImGuiKey_ = 518;
pub const ImGuiKey__ImGuiKey_Home: ImGuiKey_ = 519;
pub const ImGuiKey__ImGuiKey_End: ImGuiKey_ = 520;
pub const ImGuiKey__ImGuiKey_Insert: ImGuiKey_ = 521;
pub const ImGuiKey__ImGuiKey_Delete: ImGuiKey_ = 522;
pub const ImGuiKey__ImGuiKey_Backspace: ImGuiKey_ = 523;
pub const ImGuiKey__ImGuiKey_Space: ImGuiKey_ = 524;
pub const ImGuiKey__ImGuiKey_Enter: ImGuiKey_ = 525;
pub const ImGuiKey__ImGuiKey_Escape: ImGuiKey_ = 526;
pub const ImGuiKey__ImGuiKey_LeftCtrl: ImGuiKey_ = 527;
pub const ImGuiKey__ImGuiKey_LeftShift: ImGuiKey_ = 528;
pub const ImGuiKey__ImGuiKey_LeftAlt: ImGuiKey_ = 529;
pub const ImGuiKey__ImGuiKey_LeftSuper: ImGuiKey_ = 530;
pub const ImGuiKey__ImGuiKey_RightCtrl: ImGuiKey_ = 531;
pub const ImGuiKey__ImGuiKey_RightShift: ImGuiKey_ = 532;
pub const ImGuiKey__ImGuiKey_RightAlt: ImGuiKey_ = 533;
pub const ImGuiKey__ImGuiKey_RightSuper: ImGuiKey_ = 534;
pub const ImGuiKey__ImGuiKey_Menu: ImGuiKey_ = 535;
pub const ImGuiKey__ImGuiKey_0: ImGuiKey_ = 536;
pub const ImGuiKey__ImGuiKey_1: ImGuiKey_ = 537;
pub const ImGuiKey__ImGuiKey_2: ImGuiKey_ = 538;
pub const ImGuiKey__ImGuiKey_3: ImGuiKey_ = 539;
pub const ImGuiKey__ImGuiKey_4: ImGuiKey_ = 540;
pub const ImGuiKey__ImGuiKey_5: ImGuiKey_ = 541;
pub const ImGuiKey__ImGuiKey_6: ImGuiKey_ = 542;
pub const ImGuiKey__ImGuiKey_7: ImGuiKey_ = 543;
pub const ImGuiKey__ImGuiKey_8: ImGuiKey_ = 544;
pub const ImGuiKey__ImGuiKey_9: ImGuiKey_ = 545;
pub const ImGuiKey__ImGuiKey_A: ImGuiKey_ = 546;
pub const ImGuiKey__ImGuiKey_B: ImGuiKey_ = 547;
pub const ImGuiKey__ImGuiKey_C: ImGuiKey_ = 548;
pub const ImGuiKey__ImGuiKey_D: ImGuiKey_ = 549;
pub const ImGuiKey__ImGuiKey_E: ImGuiKey_ = 550;
pub const ImGuiKey__ImGuiKey_F: ImGuiKey_ = 551;
pub const ImGuiKey__ImGuiKey_G: ImGuiKey_ = 552;
pub const ImGuiKey__ImGuiKey_H: ImGuiKey_ = 553;
pub const ImGuiKey__ImGuiKey_I: ImGuiKey_ = 554;
pub const ImGuiKey__ImGuiKey_J: ImGuiKey_ = 555;
pub const ImGuiKey__ImGuiKey_K: ImGuiKey_ = 556;
pub const ImGuiKey__ImGuiKey_L: ImGuiKey_ = 557;
pub const ImGuiKey__ImGuiKey_M: ImGuiKey_ = 558;
pub const ImGuiKey__ImGuiKey_N: ImGuiKey_ = 559;
pub const ImGuiKey__ImGuiKey_O: ImGuiKey_ = 560;
pub const ImGuiKey__ImGuiKey_P: ImGuiKey_ = 561;
pub const ImGuiKey__ImGuiKey_Q: ImGuiKey_ = 562;
pub const ImGuiKey__ImGuiKey_R: ImGuiKey_ = 563;
pub const ImGuiKey__ImGuiKey_S: ImGuiKey_ = 564;
pub const ImGuiKey__ImGuiKey_T: ImGuiKey_ = 565;
pub const ImGuiKey__ImGuiKey_U: ImGuiKey_ = 566;
pub const ImGuiKey__ImGuiKey_V: ImGuiKey_ = 567;
pub const ImGuiKey__ImGuiKey_W: ImGuiKey_ = 568;
pub const ImGuiKey__ImGuiKey_X: ImGuiKey_ = 569;
pub const ImGuiKey__ImGuiKey_Y: ImGuiKey_ = 570;
pub const ImGuiKey__ImGuiKey_Z: ImGuiKey_ = 571;
pub const ImGuiKey__ImGuiKey_F1: ImGuiKey_ = 572;
pub const ImGuiKey__ImGuiKey_F2: ImGuiKey_ = 573;
pub const ImGuiKey__ImGuiKey_F3: ImGuiKey_ = 574;
pub const ImGuiKey__ImGuiKey_F4: ImGuiKey_ = 575;
pub const ImGuiKey__ImGuiKey_F5: ImGuiKey_ = 576;
pub const ImGuiKey__ImGuiKey_F6: ImGuiKey_ = 577;
pub const ImGuiKey__ImGuiKey_F7: ImGuiKey_ = 578;
pub const ImGuiKey__ImGuiKey_F8: ImGuiKey_ = 579;
pub const ImGuiKey__ImGuiKey_F9: ImGuiKey_ = 580;
pub const ImGuiKey__ImGuiKey_F10: ImGuiKey_ = 581;
pub const ImGuiKey__ImGuiKey_F11: ImGuiKey_ = 582;
pub const ImGuiKey__ImGuiKey_F12: ImGuiKey_ = 583;
pub const ImGuiKey__ImGuiKey_Apostrophe: ImGuiKey_ = 584;
pub const ImGuiKey__ImGuiKey_Comma: ImGuiKey_ = 585;
pub const ImGuiKey__ImGuiKey_Minus: ImGuiKey_ = 586;
pub const ImGuiKey__ImGuiKey_Period: ImGuiKey_ = 587;
pub const ImGuiKey__ImGuiKey_Slash: ImGuiKey_ = 588;
pub const ImGuiKey__ImGuiKey_Semicolon: ImGuiKey_ = 589;
pub const ImGuiKey__ImGuiKey_Equal: ImGuiKey_ = 590;
pub const ImGuiKey__ImGuiKey_LeftBracket: ImGuiKey_ = 591;
pub const ImGuiKey__ImGuiKey_Backslash: ImGuiKey_ = 592;
pub const ImGuiKey__ImGuiKey_RightBracket: ImGuiKey_ = 593;
pub const ImGuiKey__ImGuiKey_GraveAccent: ImGuiKey_ = 594;
pub const ImGuiKey__ImGuiKey_CapsLock: ImGuiKey_ = 595;
pub const ImGuiKey__ImGuiKey_ScrollLock: ImGuiKey_ = 596;
pub const ImGuiKey__ImGuiKey_NumLock: ImGuiKey_ = 597;
pub const ImGuiKey__ImGuiKey_PrintScreen: ImGuiKey_ = 598;
pub const ImGuiKey__ImGuiKey_Pause: ImGuiKey_ = 599;
pub const ImGuiKey__ImGuiKey_Keypad0: ImGuiKey_ = 600;
pub const ImGuiKey__ImGuiKey_Keypad1: ImGuiKey_ = 601;
pub const ImGuiKey__ImGuiKey_Keypad2: ImGuiKey_ = 602;
pub const ImGuiKey__ImGuiKey_Keypad3: ImGuiKey_ = 603;
pub const ImGuiKey__ImGuiKey_Keypad4: ImGuiKey_ = 604;
pub const ImGuiKey__ImGuiKey_Keypad5: ImGuiKey_ = 605;
pub const ImGuiKey__ImGuiKey_Keypad6: ImGuiKey_ = 606;
pub const ImGuiKey__ImGuiKey_Keypad7: ImGuiKey_ = 607;
pub const ImGuiKey__ImGuiKey_Keypad8: ImGuiKey_ = 608;
pub const ImGuiKey__ImGuiKey_Keypad9: ImGuiKey_ = 609;
pub const ImGuiKey__ImGuiKey_KeypadDecimal: ImGuiKey_ = 610;
pub const ImGuiKey__ImGuiKey_KeypadDivide: ImGuiKey_ = 611;
pub const ImGuiKey__ImGuiKey_KeypadMultiply: ImGuiKey_ = 612;
pub const ImGuiKey__ImGuiKey_KeypadSubtract: ImGuiKey_ = 613;
pub const ImGuiKey__ImGuiKey_KeypadAdd: ImGuiKey_ = 614;
pub const ImGuiKey__ImGuiKey_KeypadEnter: ImGuiKey_ = 615;
pub const ImGuiKey__ImGuiKey_KeypadEqual: ImGuiKey_ = 616;
pub const ImGuiKey__ImGuiKey_GamepadStart: ImGuiKey_ = 617;
pub const ImGuiKey__ImGuiKey_GamepadBack: ImGuiKey_ = 618;
pub const ImGuiKey__ImGuiKey_GamepadFaceUp: ImGuiKey_ = 619;
pub const ImGuiKey__ImGuiKey_GamepadFaceDown: ImGuiKey_ = 620;
pub const ImGuiKey__ImGuiKey_GamepadFaceLeft: ImGuiKey_ = 621;
pub const ImGuiKey__ImGuiKey_GamepadFaceRight: ImGuiKey_ = 622;
pub const ImGuiKey__ImGuiKey_GamepadDpadUp: ImGuiKey_ = 623;
pub const ImGuiKey__ImGuiKey_GamepadDpadDown: ImGuiKey_ = 624;
pub const ImGuiKey__ImGuiKey_GamepadDpadLeft: ImGuiKey_ = 625;
pub const ImGuiKey__ImGuiKey_GamepadDpadRight: ImGuiKey_ = 626;
pub const ImGuiKey__ImGuiKey_GamepadL1: ImGuiKey_ = 627;
pub const ImGuiKey__ImGuiKey_GamepadR1: ImGuiKey_ = 628;
pub const ImGuiKey__ImGuiKey_GamepadL2: ImGuiKey_ = 629;
pub const ImGuiKey__ImGuiKey_GamepadR2: ImGuiKey_ = 630;
pub const ImGuiKey__ImGuiKey_GamepadL3: ImGuiKey_ = 631;
pub const ImGuiKey__ImGuiKey_GamepadR3: ImGuiKey_ = 632;
pub const ImGuiKey__ImGuiKey_GamepadLStickUp: ImGuiKey_ = 633;
pub const ImGuiKey__ImGuiKey_GamepadLStickDown: ImGuiKey_ = 634;
pub const ImGuiKey__ImGuiKey_GamepadLStickLeft: ImGuiKey_ = 635;
pub const ImGuiKey__ImGuiKey_GamepadLStickRight: ImGuiKey_ = 636;
pub const ImGuiKey__ImGuiKey_GamepadRStickUp: ImGuiKey_ = 637;
pub const ImGuiKey__ImGuiKey_GamepadRStickDown: ImGuiKey_ = 638;
pub const ImGuiKey__ImGuiKey_GamepadRStickLeft: ImGuiKey_ = 639;
pub const ImGuiKey__ImGuiKey_GamepadRStickRight: ImGuiKey_ = 640;
pub const ImGuiKey__ImGuiKey_ModCtrl: ImGuiKey_ = 641;
pub const ImGuiKey__ImGuiKey_ModShift: ImGuiKey_ = 642;
pub const ImGuiKey__ImGuiKey_ModAlt: ImGuiKey_ = 643;
pub const ImGuiKey__ImGuiKey_ModSuper: ImGuiKey_ = 644;
pub const ImGuiKey__ImGuiKey_COUNT: ImGuiKey_ = 645;
pub const ImGuiKey__ImGuiKey_NamedKey_BEGIN: ImGuiKey_ = 512;
pub const ImGuiKey__ImGuiKey_NamedKey_END: ImGuiKey_ = 645;
pub const ImGuiKey__ImGuiKey_NamedKey_COUNT: ImGuiKey_ = 133;
pub const ImGuiKey__ImGuiKey_KeysData_SIZE: ImGuiKey_ = 645;
pub const ImGuiKey__ImGuiKey_KeysData_OFFSET: ImGuiKey_ = 0;
pub type ImGuiKey_ = ::std::os::raw::c_int;
pub const ImGuiModFlags__ImGuiModFlags_None: ImGuiModFlags_ = 0;
pub const ImGuiModFlags__ImGuiModFlags_Ctrl: ImGuiModFlags_ = 1;
pub const ImGuiModFlags__ImGuiModFlags_Shift: ImGuiModFlags_ = 2;
pub const ImGuiModFlags__ImGuiModFlags_Alt: ImGuiModFlags_ = 4;
pub const ImGuiModFlags__ImGuiModFlags_Super: ImGuiModFlags_ = 8;
pub type ImGuiModFlags_ = ::std::os::raw::c_int;
pub const ImGuiNavInput__ImGuiNavInput_Activate: ImGuiNavInput_ = 0;
pub const ImGuiNavInput__ImGuiNavInput_Cancel: ImGuiNavInput_ = 1;
pub const ImGuiNavInput__ImGuiNavInput_Input: ImGuiNavInput_ = 2;
pub const ImGuiNavInput__ImGuiNavInput_Menu: ImGuiNavInput_ = 3;
pub const ImGuiNavInput__ImGuiNavInput_DpadLeft: ImGuiNavInput_ = 4;
pub const ImGuiNavInput__ImGuiNavInput_DpadRight: ImGuiNavInput_ = 5;
pub const ImGuiNavInput__ImGuiNavInput_DpadUp: ImGuiNavInput_ = 6;
pub const ImGuiNavInput__ImGuiNavInput_DpadDown: ImGuiNavInput_ = 7;
pub const ImGuiNavInput__ImGuiNavInput_LStickLeft: ImGuiNavInput_ = 8;
pub const ImGuiNavInput__ImGuiNavInput_LStickRight: ImGuiNavInput_ = 9;
pub const ImGuiNavInput__ImGuiNavInput_LStickUp: ImGuiNavInput_ = 10;
pub const ImGuiNavInput__ImGuiNavInput_LStickDown: ImGuiNavInput_ = 11;
pub const ImGuiNavInput__ImGuiNavInput_FocusPrev: ImGuiNavInput_ = 12;
pub const ImGuiNavInput__ImGuiNavInput_FocusNext: ImGuiNavInput_ = 13;
pub const ImGuiNavInput__ImGuiNavInput_TweakSlow: ImGuiNavInput_ = 14;
pub const ImGuiNavInput__ImGuiNavInput_TweakFast: ImGuiNavInput_ = 15;
pub const ImGuiNavInput__ImGuiNavInput_KeyLeft_: ImGuiNavInput_ = 16;
pub const ImGuiNavInput__ImGuiNavInput_KeyRight_: ImGuiNavInput_ = 17;
pub const ImGuiNavInput__ImGuiNavInput_KeyUp_: ImGuiNavInput_ = 18;
pub const ImGuiNavInput__ImGuiNavInput_KeyDown_: ImGuiNavInput_ = 19;
pub const ImGuiNavInput__ImGuiNavInput_COUNT: ImGuiNavInput_ = 20;
pub type ImGuiNavInput_ = ::std::os::raw::c_int;
pub const ImGuiConfigFlags__ImGuiConfigFlags_None: ImGuiConfigFlags_ = 0;
pub const ImGuiConfigFlags__ImGuiConfigFlags_NavEnableKeyboard: ImGuiConfigFlags_ = 1;
pub const ImGuiConfigFlags__ImGuiConfigFlags_NavEnableGamepad: ImGuiConfigFlags_ = 2;
pub const ImGuiConfigFlags__ImGuiConfigFlags_NavEnableSetMousePos: ImGuiConfigFlags_ = 4;
pub const ImGuiConfigFlags__ImGuiConfigFlags_NavNoCaptureKeyboard: ImGuiConfigFlags_ = 8;
pub const ImGuiConfigFlags__ImGuiConfigFlags_NoMouse: ImGuiConfigFlags_ = 16;
pub const ImGuiConfigFlags__ImGuiConfigFlags_NoMouseCursorChange: ImGuiConfigFlags_ = 32;
pub const ImGuiConfigFlags__ImGuiConfigFlags_DockingEnable: ImGuiConfigFlags_ = 64;
pub const ImGuiConfigFlags__ImGuiConfigFlags_ViewportsEnable: ImGuiConfigFlags_ = 1024;
pub const ImGuiConfigFlags__ImGuiConfigFlags_DpiEnableScaleViewports: ImGuiConfigFlags_ = 16384;
pub const ImGuiConfigFlags__ImGuiConfigFlags_DpiEnableScaleFonts: ImGuiConfigFlags_ = 32768;
pub const ImGuiConfigFlags__ImGuiConfigFlags_IsSRGB: ImGuiConfigFlags_ = 1048576;
pub const ImGuiConfigFlags__ImGuiConfigFlags_IsTouchScreen: ImGuiConfigFlags_ = 2097152;
pub type ImGuiConfigFlags_ = ::std::os::raw::c_int;
pub const ImGuiBackendFlags__ImGuiBackendFlags_None: ImGuiBackendFlags_ = 0;
pub const ImGuiBackendFlags__ImGuiBackendFlags_HasGamepad: ImGuiBackendFlags_ = 1;
pub const ImGuiBackendFlags__ImGuiBackendFlags_HasMouseCursors: ImGuiBackendFlags_ = 2;
pub const ImGuiBackendFlags__ImGuiBackendFlags_HasSetMousePos: ImGuiBackendFlags_ = 4;
pub const ImGuiBackendFlags__ImGuiBackendFlags_RendererHasVtxOffset: ImGuiBackendFlags_ = 8;
pub const ImGuiBackendFlags__ImGuiBackendFlags_PlatformHasViewports: ImGuiBackendFlags_ = 1024;
pub const ImGuiBackendFlags__ImGuiBackendFlags_HasMouseHoveredViewport: ImGuiBackendFlags_ = 2048;
pub const ImGuiBackendFlags__ImGuiBackendFlags_RendererHasViewports: ImGuiBackendFlags_ = 4096;
pub type ImGuiBackendFlags_ = ::std::os::raw::c_int;
pub const ImGuiCol__ImGuiCol_Text: ImGuiCol_ = 0;
pub const ImGuiCol__ImGuiCol_TextDisabled: ImGuiCol_ = 1;
pub const ImGuiCol__ImGuiCol_WindowBg: ImGuiCol_ = 2;
pub const ImGuiCol__ImGuiCol_ChildBg: ImGuiCol_ = 3;
pub const ImGuiCol__ImGuiCol_PopupBg: ImGuiCol_ = 4;
pub const ImGuiCol__ImGuiCol_Border: ImGuiCol_ = 5;
pub const ImGuiCol__ImGuiCol_BorderShadow: ImGuiCol_ = 6;
pub const ImGuiCol__ImGuiCol_FrameBg: ImGuiCol_ = 7;
pub const ImGuiCol__ImGuiCol_FrameBgHovered: ImGuiCol_ = 8;
pub const ImGuiCol__ImGuiCol_FrameBgActive: ImGuiCol_ = 9;
pub const ImGuiCol__ImGuiCol_TitleBg: ImGuiCol_ = 10;
pub const ImGuiCol__ImGuiCol_TitleBgActive: ImGuiCol_ = 11;
pub const ImGuiCol__ImGuiCol_TitleBgCollapsed: ImGuiCol_ = 12;
pub const ImGuiCol__ImGuiCol_MenuBarBg: ImGuiCol_ = 13;
pub const ImGuiCol__ImGuiCol_ScrollbarBg: ImGuiCol_ = 14;
pub const ImGuiCol__ImGuiCol_ScrollbarGrab: ImGuiCol_ = 15;
pub const ImGuiCol__ImGuiCol_ScrollbarGrabHovered: ImGuiCol_ = 16;
pub const ImGuiCol__ImGuiCol_ScrollbarGrabActive: ImGuiCol_ = 17;
pub const ImGuiCol__ImGuiCol_CheckMark: ImGuiCol_ = 18;
pub const ImGuiCol__ImGuiCol_SliderGrab: ImGuiCol_ = 19;
pub const ImGuiCol__ImGuiCol_SliderGrabActive: ImGuiCol_ = 20;
pub const ImGuiCol__ImGuiCol_Button: ImGuiCol_ = 21;
pub const ImGuiCol__ImGuiCol_ButtonHovered: ImGuiCol_ = 22;
pub const ImGuiCol__ImGuiCol_ButtonActive: ImGuiCol_ = 23;
pub const ImGuiCol__ImGuiCol_Header: ImGuiCol_ = 24;
pub const ImGuiCol__ImGuiCol_HeaderHovered: ImGuiCol_ = 25;
pub const ImGuiCol__ImGuiCol_HeaderActive: ImGuiCol_ = 26;
pub const ImGuiCol__ImGuiCol_Separator: ImGuiCol_ = 27;
pub const ImGuiCol__ImGuiCol_SeparatorHovered: ImGuiCol_ = 28;
pub const ImGuiCol__ImGuiCol_SeparatorActive: ImGuiCol_ = 29;
pub const ImGuiCol__ImGuiCol_ResizeGrip: ImGuiCol_ = 30;
pub const ImGuiCol__ImGuiCol_ResizeGripHovered: ImGuiCol_ = 31;
pub const ImGuiCol__ImGuiCol_ResizeGripActive: ImGuiCol_ = 32;
pub const ImGuiCol__ImGuiCol_Tab: ImGuiCol_ = 33;
pub const ImGuiCol__ImGuiCol_TabHovered: ImGuiCol_ = 34;
pub const ImGuiCol__ImGuiCol_TabActive: ImGuiCol_ = 35;
pub const ImGuiCol__ImGuiCol_TabUnfocused: ImGuiCol_ = 36;
pub const ImGuiCol__ImGuiCol_TabUnfocusedActive: ImGuiCol_ = 37;
pub const ImGuiCol__ImGuiCol_DockingPreview: ImGuiCol_ = 38;
pub const ImGuiCol__ImGuiCol_DockingEmptyBg: ImGuiCol_ = 39;
pub const ImGuiCol__ImGuiCol_PlotLines: ImGuiCol_ = 40;
pub const ImGuiCol__ImGuiCol_PlotLinesHovered: ImGuiCol_ = 41;
pub const ImGuiCol__ImGuiCol_PlotHistogram: ImGuiCol_ = 42;
pub const ImGuiCol__ImGuiCol_PlotHistogramHovered: ImGuiCol_ = 43;
pub const ImGuiCol__ImGuiCol_TableHeaderBg: ImGuiCol_ = 44;
pub const ImGuiCol__ImGuiCol_TableBorderStrong: ImGuiCol_ = 45;
pub const ImGuiCol__ImGuiCol_TableBorderLight: ImGuiCol_ = 46;
pub const ImGuiCol__ImGuiCol_TableRowBg: ImGuiCol_ = 47;
pub const ImGuiCol__ImGuiCol_TableRowBgAlt: ImGuiCol_ = 48;
pub const ImGuiCol__ImGuiCol_TextSelectedBg: ImGuiCol_ = 49;
pub const ImGuiCol__ImGuiCol_DragDropTarget: ImGuiCol_ = 50;
pub const ImGuiCol__ImGuiCol_NavHighlight: ImGuiCol_ = 51;
pub const ImGuiCol__ImGuiCol_NavWindowingHighlight: ImGuiCol_ = 52;
pub const ImGuiCol__ImGuiCol_NavWindowingDimBg: ImGuiCol_ = 53;
pub const ImGuiCol__ImGuiCol_ModalWindowDimBg: ImGuiCol_ = 54;
pub const ImGuiCol__ImGuiCol_COUNT: ImGuiCol_ = 55;
pub type ImGuiCol_ = ::std::os::raw::c_int;
pub const ImGuiStyleVar__ImGuiStyleVar_Alpha: ImGuiStyleVar_ = 0;
pub const ImGuiStyleVar__ImGuiStyleVar_DisabledAlpha: ImGuiStyleVar_ = 1;
pub const ImGuiStyleVar__ImGuiStyleVar_WindowPadding: ImGuiStyleVar_ = 2;
pub const ImGuiStyleVar__ImGuiStyleVar_WindowRounding: ImGuiStyleVar_ = 3;
pub const ImGuiStyleVar__ImGuiStyleVar_WindowBorderSize: ImGuiStyleVar_ = 4;
pub const ImGuiStyleVar__ImGuiStyleVar_WindowMinSize: ImGuiStyleVar_ = 5;
pub const ImGuiStyleVar__ImGuiStyleVar_WindowTitleAlign: ImGuiStyleVar_ = 6;
pub const ImGuiStyleVar__ImGuiStyleVar_ChildRounding: ImGuiStyleVar_ = 7;
pub const ImGuiStyleVar__ImGuiStyleVar_ChildBorderSize: ImGuiStyleVar_ = 8;
pub const ImGuiStyleVar__ImGuiStyleVar_PopupRounding: ImGuiStyleVar_ = 9;
pub const ImGuiStyleVar__ImGuiStyleVar_PopupBorderSize: ImGuiStyleVar_ = 10;
pub const ImGuiStyleVar__ImGuiStyleVar_FramePadding: ImGuiStyleVar_ = 11;
pub const ImGuiStyleVar__ImGuiStyleVar_FrameRounding: ImGuiStyleVar_ = 12;
pub const ImGuiStyleVar__ImGuiStyleVar_FrameBorderSize: ImGuiStyleVar_ = 13;
pub const ImGuiStyleVar__ImGuiStyleVar_ItemSpacing: ImGuiStyleVar_ = 14;
pub const ImGuiStyleVar__ImGuiStyleVar_ItemInnerSpacing: ImGuiStyleVar_ = 15;
pub const ImGuiStyleVar__ImGuiStyleVar_IndentSpacing: ImGuiStyleVar_ = 16;
pub const ImGuiStyleVar__ImGuiStyleVar_CellPadding: ImGuiStyleVar_ = 17;
pub const ImGuiStyleVar__ImGuiStyleVar_ScrollbarSize: ImGuiStyleVar_ = 18;
pub const ImGuiStyleVar__ImGuiStyleVar_ScrollbarRounding: ImGuiStyleVar_ = 19;
pub const ImGuiStyleVar__ImGuiStyleVar_GrabMinSize: ImGuiStyleVar_ = 20;
pub const ImGuiStyleVar__ImGuiStyleVar_GrabRounding: ImGuiStyleVar_ = 21;
pub const ImGuiStyleVar__ImGuiStyleVar_TabRounding: ImGuiStyleVar_ = 22;
pub const ImGuiStyleVar__ImGuiStyleVar_ButtonTextAlign: ImGuiStyleVar_ = 23;
pub const ImGuiStyleVar__ImGuiStyleVar_SelectableTextAlign: ImGuiStyleVar_ = 24;
pub const ImGuiStyleVar__ImGuiStyleVar_COUNT: ImGuiStyleVar_ = 25;
pub type ImGuiStyleVar_ = ::std::os::raw::c_int;
pub const ImGuiButtonFlags__ImGuiButtonFlags_None: ImGuiButtonFlags_ = 0;
pub const ImGuiButtonFlags__ImGuiButtonFlags_MouseButtonLeft: ImGuiButtonFlags_ = 1;
pub const ImGuiButtonFlags__ImGuiButtonFlags_MouseButtonRight: ImGuiButtonFlags_ = 2;
pub const ImGuiButtonFlags__ImGuiButtonFlags_MouseButtonMiddle: ImGuiButtonFlags_ = 4;
pub const ImGuiButtonFlags__ImGuiButtonFlags_MouseButtonMask_: ImGuiButtonFlags_ = 7;
pub const ImGuiButtonFlags__ImGuiButtonFlags_MouseButtonDefault_: ImGuiButtonFlags_ = 1;
pub type ImGuiButtonFlags_ = ::std::os::raw::c_int;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_None: ImGuiColorEditFlags_ = 0;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoAlpha: ImGuiColorEditFlags_ = 2;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoPicker: ImGuiColorEditFlags_ = 4;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoOptions: ImGuiColorEditFlags_ = 8;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoSmallPreview: ImGuiColorEditFlags_ = 16;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoInputs: ImGuiColorEditFlags_ = 32;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoTooltip: ImGuiColorEditFlags_ = 64;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoLabel: ImGuiColorEditFlags_ = 128;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoSidePreview: ImGuiColorEditFlags_ = 256;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoDragDrop: ImGuiColorEditFlags_ = 512;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_NoBorder: ImGuiColorEditFlags_ = 1024;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_AlphaBar: ImGuiColorEditFlags_ = 65536;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_AlphaPreview: ImGuiColorEditFlags_ = 131072;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_AlphaPreviewHalf: ImGuiColorEditFlags_ = 262144;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_HDR: ImGuiColorEditFlags_ = 524288;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_DisplayRGB: ImGuiColorEditFlags_ = 1048576;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_DisplayHSV: ImGuiColorEditFlags_ = 2097152;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_DisplayHex: ImGuiColorEditFlags_ = 4194304;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_Uint8: ImGuiColorEditFlags_ = 8388608;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_Float: ImGuiColorEditFlags_ = 16777216;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_PickerHueBar: ImGuiColorEditFlags_ = 33554432;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_PickerHueWheel: ImGuiColorEditFlags_ = 67108864;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_InputRGB: ImGuiColorEditFlags_ = 134217728;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_InputHSV: ImGuiColorEditFlags_ = 268435456;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_DefaultOptions_: ImGuiColorEditFlags_ =
    177209344;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_DisplayMask_: ImGuiColorEditFlags_ = 7340032;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_DataTypeMask_: ImGuiColorEditFlags_ = 25165824;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_PickerMask_: ImGuiColorEditFlags_ = 100663296;
pub const ImGuiColorEditFlags__ImGuiColorEditFlags_InputMask_: ImGuiColorEditFlags_ = 402653184;
pub type ImGuiColorEditFlags_ = ::std::os::raw::c_int;
pub const ImGuiSliderFlags__ImGuiSliderFlags_None: ImGuiSliderFlags_ = 0;
pub const ImGuiSliderFlags__ImGuiSliderFlags_AlwaysClamp: ImGuiSliderFlags_ = 16;
pub const ImGuiSliderFlags__ImGuiSliderFlags_Logarithmic: ImGuiSliderFlags_ = 32;
pub const ImGuiSliderFlags__ImGuiSliderFlags_NoRoundToFormat: ImGuiSliderFlags_ = 64;
pub const ImGuiSliderFlags__ImGuiSliderFlags_NoInput: ImGuiSliderFlags_ = 128;
pub const ImGuiSliderFlags__ImGuiSliderFlags_InvalidMask_: ImGuiSliderFlags_ = 1879048207;
pub type ImGuiSliderFlags_ = ::std::os::raw::c_int;
pub const ImGuiMouseButton__ImGuiMouseButton_Left: ImGuiMouseButton_ = 0;
pub const ImGuiMouseButton__ImGuiMouseButton_Right: ImGuiMouseButton_ = 1;
pub const ImGuiMouseButton__ImGuiMouseButton_Middle: ImGuiMouseButton_ = 2;
pub const ImGuiMouseButton__ImGuiMouseButton_COUNT: ImGuiMouseButton_ = 5;
pub type ImGuiMouseButton_ = ::std::os::raw::c_int;
pub const ImGuiMouseCursor__ImGuiMouseCursor_None: ImGuiMouseCursor_ = -1;
pub const ImGuiMouseCursor__ImGuiMouseCursor_Arrow: ImGuiMouseCursor_ = 0;
pub const ImGuiMouseCursor__ImGuiMouseCursor_TextInput: ImGuiMouseCursor_ = 1;
pub const ImGuiMouseCursor__ImGuiMouseCursor_ResizeAll: ImGuiMouseCursor_ = 2;
pub const ImGuiMouseCursor__ImGuiMouseCursor_ResizeNS: ImGuiMouseCursor_ = 3;
pub const ImGuiMouseCursor__ImGuiMouseCursor_ResizeEW: ImGuiMouseCursor_ = 4;
pub const ImGuiMouseCursor__ImGuiMouseCursor_ResizeNESW: ImGuiMouseCursor_ = 5;
pub const ImGuiMouseCursor__ImGuiMouseCursor_ResizeNWSE: ImGuiMouseCursor_ = 6;
pub const ImGuiMouseCursor__ImGuiMouseCursor_Hand: ImGuiMouseCursor_ = 7;
pub const ImGuiMouseCursor__ImGuiMouseCursor_NotAllowed: ImGuiMouseCursor_ = 8;
pub const ImGuiMouseCursor__ImGuiMouseCursor_COUNT: ImGuiMouseCursor_ = 9;
pub type ImGuiMouseCursor_ = ::std::os::raw::c_int;
pub const ImGuiCond__ImGuiCond_None: ImGuiCond_ = 0;
pub const ImGuiCond__ImGuiCond_Always: ImGuiCond_ = 1;
pub const ImGuiCond__ImGuiCond_Once: ImGuiCond_ = 2;
pub const ImGuiCond__ImGuiCond_FirstUseEver: ImGuiCond_ = 4;
pub const ImGuiCond__ImGuiCond_Appearing: ImGuiCond_ = 8;
pub type ImGuiCond_ = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiStyle {
    pub Alpha: f32,
    pub DisabledAlpha: f32,
    pub WindowPadding: ImVec2,
    pub WindowRounding: f32,
    pub WindowBorderSize: f32,
    pub WindowMinSize: ImVec2,
    pub WindowTitleAlign: ImVec2,
    pub WindowMenuButtonPosition: ImGuiDir,
    pub ChildRounding: f32,
    pub ChildBorderSize: f32,
    pub PopupRounding: f32,
    pub PopupBorderSize: f32,
    pub FramePadding: ImVec2,
    pub FrameRounding: f32,
    pub FrameBorderSize: f32,
    pub ItemSpacing: ImVec2,
    pub ItemInnerSpacing: ImVec2,
    pub CellPadding: ImVec2,
    pub TouchExtraPadding: ImVec2,
    pub IndentSpacing: f32,
    pub ColumnsMinSpacing: f32,
    pub ScrollbarSize: f32,
    pub ScrollbarRounding: f32,
    pub GrabMinSize: f32,
    pub GrabRounding: f32,
    pub LogSliderDeadzone: f32,
    pub TabRounding: f32,
    pub TabBorderSize: f32,
    pub TabMinWidthForCloseButton: f32,
    pub ColorButtonPosition: ImGuiDir,
    pub ButtonTextAlign: ImVec2,
    pub SelectableTextAlign: ImVec2,
    pub DisplayWindowPadding: ImVec2,
    pub DisplaySafeAreaPadding: ImVec2,
    pub MouseCursorScale: f32,
    pub AntiAliasedLines: bool,
    pub AntiAliasedLinesUseTex: bool,
    pub AntiAliasedFill: bool,
    pub CurveTessellationTol: f32,
    pub CircleTessellationMaxError: f32,
    pub Colors: [ImVec4; 55usize],
}
#[test]
fn bindgen_test_layout_ImGuiStyle() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiStyle>(),
        1080usize,
        concat!("Size of: ", stringify!(ImGuiStyle))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiStyle>(),
        4usize,
        concat!("Alignment of ", stringify!(ImGuiStyle))
    );
    fn test_field_Alpha() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Alpha) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(Alpha)
            )
        );
    }
    test_field_Alpha();
    fn test_field_DisabledAlpha() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisabledAlpha) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(DisabledAlpha)
            )
        );
    }
    test_field_DisabledAlpha();
    fn test_field_WindowPadding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WindowPadding) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(WindowPadding)
            )
        );
    }
    test_field_WindowPadding();
    fn test_field_WindowRounding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WindowRounding) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(WindowRounding)
            )
        );
    }
    test_field_WindowRounding();
    fn test_field_WindowBorderSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WindowBorderSize) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(WindowBorderSize)
            )
        );
    }
    test_field_WindowBorderSize();
    fn test_field_WindowMinSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WindowMinSize) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(WindowMinSize)
            )
        );
    }
    test_field_WindowMinSize();
    fn test_field_WindowTitleAlign() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WindowTitleAlign) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(WindowTitleAlign)
            )
        );
    }
    test_field_WindowTitleAlign();
    fn test_field_WindowMenuButtonPosition() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WindowMenuButtonPosition) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(WindowMenuButtonPosition)
            )
        );
    }
    test_field_WindowMenuButtonPosition();
    fn test_field_ChildRounding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ChildRounding) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(ChildRounding)
            )
        );
    }
    test_field_ChildRounding();
    fn test_field_ChildBorderSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ChildBorderSize) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(ChildBorderSize)
            )
        );
    }
    test_field_ChildBorderSize();
    fn test_field_PopupRounding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).PopupRounding) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(PopupRounding)
            )
        );
    }
    test_field_PopupRounding();
    fn test_field_PopupBorderSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).PopupBorderSize) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(PopupBorderSize)
            )
        );
    }
    test_field_PopupBorderSize();
    fn test_field_FramePadding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FramePadding) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(FramePadding)
            )
        );
    }
    test_field_FramePadding();
    fn test_field_FrameRounding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FrameRounding) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(FrameRounding)
            )
        );
    }
    test_field_FrameRounding();
    fn test_field_FrameBorderSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FrameBorderSize) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(FrameBorderSize)
            )
        );
    }
    test_field_FrameBorderSize();
    fn test_field_ItemSpacing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ItemSpacing) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(ItemSpacing)
            )
        );
    }
    test_field_ItemSpacing();
    fn test_field_ItemInnerSpacing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ItemInnerSpacing) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(ItemInnerSpacing)
            )
        );
    }
    test_field_ItemInnerSpacing();
    fn test_field_CellPadding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CellPadding) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(CellPadding)
            )
        );
    }
    test_field_CellPadding();
    fn test_field_TouchExtraPadding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TouchExtraPadding) as usize - ptr as usize
            },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(TouchExtraPadding)
            )
        );
    }
    test_field_TouchExtraPadding();
    fn test_field_IndentSpacing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IndentSpacing) as usize - ptr as usize
            },
            108usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(IndentSpacing)
            )
        );
    }
    test_field_IndentSpacing();
    fn test_field_ColumnsMinSpacing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ColumnsMinSpacing) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(ColumnsMinSpacing)
            )
        );
    }
    test_field_ColumnsMinSpacing();
    fn test_field_ScrollbarSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ScrollbarSize) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(ScrollbarSize)
            )
        );
    }
    test_field_ScrollbarSize();
    fn test_field_ScrollbarRounding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ScrollbarRounding) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(ScrollbarRounding)
            )
        );
    }
    test_field_ScrollbarRounding();
    fn test_field_GrabMinSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GrabMinSize) as usize - ptr as usize
            },
            124usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(GrabMinSize)
            )
        );
    }
    test_field_GrabMinSize();
    fn test_field_GrabRounding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GrabRounding) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(GrabRounding)
            )
        );
    }
    test_field_GrabRounding();
    fn test_field_LogSliderDeadzone() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).LogSliderDeadzone) as usize - ptr as usize
            },
            132usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(LogSliderDeadzone)
            )
        );
    }
    test_field_LogSliderDeadzone();
    fn test_field_TabRounding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TabRounding) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(TabRounding)
            )
        );
    }
    test_field_TabRounding();
    fn test_field_TabBorderSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TabBorderSize) as usize - ptr as usize
            },
            140usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(TabBorderSize)
            )
        );
    }
    test_field_TabBorderSize();
    fn test_field_TabMinWidthForCloseButton() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TabMinWidthForCloseButton) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(TabMinWidthForCloseButton)
            )
        );
    }
    test_field_TabMinWidthForCloseButton();
    fn test_field_ColorButtonPosition() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ColorButtonPosition) as usize - ptr as usize
            },
            148usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(ColorButtonPosition)
            )
        );
    }
    test_field_ColorButtonPosition();
    fn test_field_ButtonTextAlign() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ButtonTextAlign) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(ButtonTextAlign)
            )
        );
    }
    test_field_ButtonTextAlign();
    fn test_field_SelectableTextAlign() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SelectableTextAlign) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(SelectableTextAlign)
            )
        );
    }
    test_field_SelectableTextAlign();
    fn test_field_DisplayWindowPadding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisplayWindowPadding) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(DisplayWindowPadding)
            )
        );
    }
    test_field_DisplayWindowPadding();
    fn test_field_DisplaySafeAreaPadding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisplaySafeAreaPadding) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(DisplaySafeAreaPadding)
            )
        );
    }
    test_field_DisplaySafeAreaPadding();
    fn test_field_MouseCursorScale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseCursorScale) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(MouseCursorScale)
            )
        );
    }
    test_field_MouseCursorScale();
    fn test_field_AntiAliasedLines() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AntiAliasedLines) as usize - ptr as usize
            },
            188usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(AntiAliasedLines)
            )
        );
    }
    test_field_AntiAliasedLines();
    fn test_field_AntiAliasedLinesUseTex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AntiAliasedLinesUseTex) as usize - ptr as usize
            },
            189usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(AntiAliasedLinesUseTex)
            )
        );
    }
    test_field_AntiAliasedLinesUseTex();
    fn test_field_AntiAliasedFill() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AntiAliasedFill) as usize - ptr as usize
            },
            190usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(AntiAliasedFill)
            )
        );
    }
    test_field_AntiAliasedFill();
    fn test_field_CurveTessellationTol() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CurveTessellationTol) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(CurveTessellationTol)
            )
        );
    }
    test_field_CurveTessellationTol();
    fn test_field_CircleTessellationMaxError() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CircleTessellationMaxError) as usize - ptr as usize
            },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(CircleTessellationMaxError)
            )
        );
    }
    test_field_CircleTessellationMaxError();
    fn test_field_Colors() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStyle>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Colors) as usize - ptr as usize
            },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStyle),
                "::",
                stringify!(Colors)
            )
        );
    }
    test_field_Colors();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiKeyData {
    pub Down: bool,
    pub DownDuration: f32,
    pub DownDurationPrev: f32,
    pub AnalogValue: f32,
}
#[test]
fn bindgen_test_layout_ImGuiKeyData() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiKeyData>(),
        16usize,
        concat!("Size of: ", stringify!(ImGuiKeyData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiKeyData>(),
        4usize,
        concat!("Alignment of ", stringify!(ImGuiKeyData))
    );
    fn test_field_Down() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiKeyData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Down) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiKeyData),
                "::",
                stringify!(Down)
            )
        );
    }
    test_field_Down();
    fn test_field_DownDuration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiKeyData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DownDuration) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiKeyData),
                "::",
                stringify!(DownDuration)
            )
        );
    }
    test_field_DownDuration();
    fn test_field_DownDurationPrev() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiKeyData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DownDurationPrev) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiKeyData),
                "::",
                stringify!(DownDurationPrev)
            )
        );
    }
    test_field_DownDurationPrev();
    fn test_field_AnalogValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiKeyData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AnalogValue) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiKeyData),
                "::",
                stringify!(AnalogValue)
            )
        );
    }
    test_field_AnalogValue();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImWchar {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImWchar,
}
#[test]
fn bindgen_test_layout_ImVector_ImWchar() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImWchar>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImWchar))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImWchar>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImWchar))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImWchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImWchar),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImWchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImWchar),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImWchar>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImWchar),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiIO {
    pub ConfigFlags: ImGuiConfigFlags,
    pub BackendFlags: ImGuiBackendFlags,
    pub DisplaySize: ImVec2,
    pub DeltaTime: f32,
    pub IniSavingRate: f32,
    pub IniFilename: *const ::std::os::raw::c_char,
    pub LogFilename: *const ::std::os::raw::c_char,
    pub MouseDoubleClickTime: f32,
    pub MouseDoubleClickMaxDist: f32,
    pub MouseDragThreshold: f32,
    pub KeyRepeatDelay: f32,
    pub KeyRepeatRate: f32,
    pub UserData: *mut ::std::os::raw::c_void,
    pub Fonts: *mut ImFontAtlas,
    pub FontGlobalScale: f32,
    pub FontAllowUserScaling: bool,
    pub FontDefault: *mut ImFont,
    pub DisplayFramebufferScale: ImVec2,
    pub ConfigDockingNoSplit: bool,
    pub ConfigDockingWithShift: bool,
    pub ConfigDockingAlwaysTabBar: bool,
    pub ConfigDockingTransparentPayload: bool,
    pub ConfigViewportsNoAutoMerge: bool,
    pub ConfigViewportsNoTaskBarIcon: bool,
    pub ConfigViewportsNoDecoration: bool,
    pub ConfigViewportsNoDefaultParent: bool,
    pub MouseDrawCursor: bool,
    pub ConfigMacOSXBehaviors: bool,
    pub ConfigInputTrickleEventQueue: bool,
    pub ConfigInputTextCursorBlink: bool,
    pub ConfigDragClickToInputText: bool,
    pub ConfigWindowsResizeFromEdges: bool,
    pub ConfigWindowsMoveFromTitleBarOnly: bool,
    pub ConfigMemoryCompactTimer: f32,
    pub BackendPlatformName: *const ::std::os::raw::c_char,
    pub BackendRendererName: *const ::std::os::raw::c_char,
    pub BackendPlatformUserData: *mut ::std::os::raw::c_void,
    pub BackendRendererUserData: *mut ::std::os::raw::c_void,
    pub BackendLanguageUserData: *mut ::std::os::raw::c_void,
    pub GetClipboardTextFn: ::std::option::Option<
        unsafe extern "C" fn(
            user_data: *mut ::std::os::raw::c_void,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub SetClipboardTextFn: ::std::option::Option<
        unsafe extern "C" fn(
            user_data: *mut ::std::os::raw::c_void,
            text: *const ::std::os::raw::c_char,
        ),
    >,
    pub ClipboardUserData: *mut ::std::os::raw::c_void,
    pub SetPlatformImeDataFn: ::std::option::Option<
        unsafe extern "C" fn(viewport: *mut ImGuiViewport, data: *mut ImGuiPlatformImeData),
    >,
    pub _UnusedPadding: *mut ::std::os::raw::c_void,
    pub WantCaptureMouse: bool,
    pub WantCaptureKeyboard: bool,
    pub WantTextInput: bool,
    pub WantSetMousePos: bool,
    pub WantSaveIniSettings: bool,
    pub NavActive: bool,
    pub NavVisible: bool,
    pub Framerate: f32,
    pub MetricsRenderVertices: ::std::os::raw::c_int,
    pub MetricsRenderIndices: ::std::os::raw::c_int,
    pub MetricsRenderWindows: ::std::os::raw::c_int,
    pub MetricsActiveWindows: ::std::os::raw::c_int,
    pub MetricsActiveAllocations: ::std::os::raw::c_int,
    pub MouseDelta: ImVec2,
    pub KeyMap: [::std::os::raw::c_int; 645usize],
    pub KeysDown: [bool; 645usize],
    pub MousePos: ImVec2,
    pub MouseDown: [bool; 5usize],
    pub MouseWheel: f32,
    pub MouseWheelH: f32,
    pub MouseHoveredViewport: ImGuiID,
    pub KeyCtrl: bool,
    pub KeyShift: bool,
    pub KeyAlt: bool,
    pub KeySuper: bool,
    pub NavInputs: [f32; 20usize],
    pub KeyMods: ImGuiModFlags,
    pub KeysData: [ImGuiKeyData; 645usize],
    pub WantCaptureMouseUnlessPopupClose: bool,
    pub MousePosPrev: ImVec2,
    pub MouseClickedPos: [ImVec2; 5usize],
    pub MouseClickedTime: [f64; 5usize],
    pub MouseClicked: [bool; 5usize],
    pub MouseDoubleClicked: [bool; 5usize],
    pub MouseClickedCount: [ImU16; 5usize],
    pub MouseClickedLastCount: [ImU16; 5usize],
    pub MouseReleased: [bool; 5usize],
    pub MouseDownOwned: [bool; 5usize],
    pub MouseDownOwnedUnlessPopupClose: [bool; 5usize],
    pub MouseDownDuration: [f32; 5usize],
    pub MouseDownDurationPrev: [f32; 5usize],
    pub MouseDragMaxDistanceAbs: [ImVec2; 5usize],
    pub MouseDragMaxDistanceSqr: [f32; 5usize],
    pub NavInputsDownDuration: [f32; 20usize],
    pub NavInputsDownDurationPrev: [f32; 20usize],
    pub PenPressure: f32,
    pub AppFocusLost: bool,
    pub AppAcceptingEvents: bool,
    pub BackendUsingLegacyKeyArrays: ImS8,
    pub BackendUsingLegacyNavInputArray: bool,
    pub InputQueueSurrogate: ImWchar16,
    pub InputQueueCharacters: ImVector_ImWchar,
}
#[test]
fn bindgen_test_layout_ImGuiIO() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiIO>(),
        14344usize,
        concat!("Size of: ", stringify!(ImGuiIO))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiIO>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiIO))
    );
    fn test_field_ConfigFlags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigFlags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigFlags)
            )
        );
    }
    test_field_ConfigFlags();
    fn test_field_BackendFlags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BackendFlags) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(BackendFlags)
            )
        );
    }
    test_field_BackendFlags();
    fn test_field_DisplaySize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisplaySize) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(DisplaySize)
            )
        );
    }
    test_field_DisplaySize();
    fn test_field_DeltaTime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DeltaTime) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(DeltaTime)
            )
        );
    }
    test_field_DeltaTime();
    fn test_field_IniSavingRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IniSavingRate) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(IniSavingRate)
            )
        );
    }
    test_field_IniSavingRate();
    fn test_field_IniFilename() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IniFilename) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(IniFilename)
            )
        );
    }
    test_field_IniFilename();
    fn test_field_LogFilename() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).LogFilename) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(LogFilename)
            )
        );
    }
    test_field_LogFilename();
    fn test_field_MouseDoubleClickTime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDoubleClickTime) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDoubleClickTime)
            )
        );
    }
    test_field_MouseDoubleClickTime();
    fn test_field_MouseDoubleClickMaxDist() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDoubleClickMaxDist) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDoubleClickMaxDist)
            )
        );
    }
    test_field_MouseDoubleClickMaxDist();
    fn test_field_MouseDragThreshold() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDragThreshold) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDragThreshold)
            )
        );
    }
    test_field_MouseDragThreshold();
    fn test_field_KeyRepeatDelay() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeyRepeatDelay) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeyRepeatDelay)
            )
        );
    }
    test_field_KeyRepeatDelay();
    fn test_field_KeyRepeatRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeyRepeatRate) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeyRepeatRate)
            )
        );
    }
    test_field_KeyRepeatRate();
    fn test_field_UserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UserData) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(UserData)
            )
        );
    }
    test_field_UserData();
    fn test_field_Fonts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Fonts) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(Fonts)
            )
        );
    }
    test_field_Fonts();
    fn test_field_FontGlobalScale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FontGlobalScale) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(FontGlobalScale)
            )
        );
    }
    test_field_FontGlobalScale();
    fn test_field_FontAllowUserScaling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FontAllowUserScaling) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(FontAllowUserScaling)
            )
        );
    }
    test_field_FontAllowUserScaling();
    fn test_field_FontDefault() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FontDefault) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(FontDefault)
            )
        );
    }
    test_field_FontDefault();
    fn test_field_DisplayFramebufferScale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisplayFramebufferScale) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(DisplayFramebufferScale)
            )
        );
    }
    test_field_DisplayFramebufferScale();
    fn test_field_ConfigDockingNoSplit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigDockingNoSplit) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigDockingNoSplit)
            )
        );
    }
    test_field_ConfigDockingNoSplit();
    fn test_field_ConfigDockingWithShift() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigDockingWithShift) as usize - ptr as usize
            },
            105usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigDockingWithShift)
            )
        );
    }
    test_field_ConfigDockingWithShift();
    fn test_field_ConfigDockingAlwaysTabBar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigDockingAlwaysTabBar) as usize - ptr as usize
            },
            106usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigDockingAlwaysTabBar)
            )
        );
    }
    test_field_ConfigDockingAlwaysTabBar();
    fn test_field_ConfigDockingTransparentPayload() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigDockingTransparentPayload) as usize - ptr as usize
            },
            107usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigDockingTransparentPayload)
            )
        );
    }
    test_field_ConfigDockingTransparentPayload();
    fn test_field_ConfigViewportsNoAutoMerge() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigViewportsNoAutoMerge) as usize - ptr as usize
            },
            108usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigViewportsNoAutoMerge)
            )
        );
    }
    test_field_ConfigViewportsNoAutoMerge();
    fn test_field_ConfigViewportsNoTaskBarIcon() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigViewportsNoTaskBarIcon) as usize - ptr as usize
            },
            109usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigViewportsNoTaskBarIcon)
            )
        );
    }
    test_field_ConfigViewportsNoTaskBarIcon();
    fn test_field_ConfigViewportsNoDecoration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigViewportsNoDecoration) as usize - ptr as usize
            },
            110usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigViewportsNoDecoration)
            )
        );
    }
    test_field_ConfigViewportsNoDecoration();
    fn test_field_ConfigViewportsNoDefaultParent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigViewportsNoDefaultParent) as usize - ptr as usize
            },
            111usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigViewportsNoDefaultParent)
            )
        );
    }
    test_field_ConfigViewportsNoDefaultParent();
    fn test_field_MouseDrawCursor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDrawCursor) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDrawCursor)
            )
        );
    }
    test_field_MouseDrawCursor();
    fn test_field_ConfigMacOSXBehaviors() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigMacOSXBehaviors) as usize - ptr as usize
            },
            113usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigMacOSXBehaviors)
            )
        );
    }
    test_field_ConfigMacOSXBehaviors();
    fn test_field_ConfigInputTrickleEventQueue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigInputTrickleEventQueue) as usize - ptr as usize
            },
            114usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigInputTrickleEventQueue)
            )
        );
    }
    test_field_ConfigInputTrickleEventQueue();
    fn test_field_ConfigInputTextCursorBlink() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigInputTextCursorBlink) as usize - ptr as usize
            },
            115usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigInputTextCursorBlink)
            )
        );
    }
    test_field_ConfigInputTextCursorBlink();
    fn test_field_ConfigDragClickToInputText() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigDragClickToInputText) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigDragClickToInputText)
            )
        );
    }
    test_field_ConfigDragClickToInputText();
    fn test_field_ConfigWindowsResizeFromEdges() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigWindowsResizeFromEdges) as usize - ptr as usize
            },
            117usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigWindowsResizeFromEdges)
            )
        );
    }
    test_field_ConfigWindowsResizeFromEdges();
    fn test_field_ConfigWindowsMoveFromTitleBarOnly() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigWindowsMoveFromTitleBarOnly) as usize
                    - ptr as usize
            },
            118usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigWindowsMoveFromTitleBarOnly)
            )
        );
    }
    test_field_ConfigWindowsMoveFromTitleBarOnly();
    fn test_field_ConfigMemoryCompactTimer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ConfigMemoryCompactTimer) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ConfigMemoryCompactTimer)
            )
        );
    }
    test_field_ConfigMemoryCompactTimer();
    fn test_field_BackendPlatformName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BackendPlatformName) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(BackendPlatformName)
            )
        );
    }
    test_field_BackendPlatformName();
    fn test_field_BackendRendererName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BackendRendererName) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(BackendRendererName)
            )
        );
    }
    test_field_BackendRendererName();
    fn test_field_BackendPlatformUserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BackendPlatformUserData) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(BackendPlatformUserData)
            )
        );
    }
    test_field_BackendPlatformUserData();
    fn test_field_BackendRendererUserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BackendRendererUserData) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(BackendRendererUserData)
            )
        );
    }
    test_field_BackendRendererUserData();
    fn test_field_BackendLanguageUserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BackendLanguageUserData) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(BackendLanguageUserData)
            )
        );
    }
    test_field_BackendLanguageUserData();
    fn test_field_GetClipboardTextFn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetClipboardTextFn) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(GetClipboardTextFn)
            )
        );
    }
    test_field_GetClipboardTextFn();
    fn test_field_SetClipboardTextFn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetClipboardTextFn) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(SetClipboardTextFn)
            )
        );
    }
    test_field_SetClipboardTextFn();
    fn test_field_ClipboardUserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ClipboardUserData) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(ClipboardUserData)
            )
        );
    }
    test_field_ClipboardUserData();
    fn test_field_SetPlatformImeDataFn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetPlatformImeDataFn) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(SetPlatformImeDataFn)
            )
        );
    }
    test_field_SetPlatformImeDataFn();
    fn test_field__UnusedPadding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._UnusedPadding) as usize - ptr as usize
            },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(_UnusedPadding)
            )
        );
    }
    test_field__UnusedPadding();
    fn test_field_WantCaptureMouse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WantCaptureMouse) as usize - ptr as usize
            },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(WantCaptureMouse)
            )
        );
    }
    test_field_WantCaptureMouse();
    fn test_field_WantCaptureKeyboard() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WantCaptureKeyboard) as usize - ptr as usize
            },
            209usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(WantCaptureKeyboard)
            )
        );
    }
    test_field_WantCaptureKeyboard();
    fn test_field_WantTextInput() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WantTextInput) as usize - ptr as usize
            },
            210usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(WantTextInput)
            )
        );
    }
    test_field_WantTextInput();
    fn test_field_WantSetMousePos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WantSetMousePos) as usize - ptr as usize
            },
            211usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(WantSetMousePos)
            )
        );
    }
    test_field_WantSetMousePos();
    fn test_field_WantSaveIniSettings() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WantSaveIniSettings) as usize - ptr as usize
            },
            212usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(WantSaveIniSettings)
            )
        );
    }
    test_field_WantSaveIniSettings();
    fn test_field_NavActive() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).NavActive) as usize - ptr as usize
            },
            213usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(NavActive)
            )
        );
    }
    test_field_NavActive();
    fn test_field_NavVisible() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).NavVisible) as usize - ptr as usize
            },
            214usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(NavVisible)
            )
        );
    }
    test_field_NavVisible();
    fn test_field_Framerate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Framerate) as usize - ptr as usize
            },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(Framerate)
            )
        );
    }
    test_field_Framerate();
    fn test_field_MetricsRenderVertices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MetricsRenderVertices) as usize - ptr as usize
            },
            220usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MetricsRenderVertices)
            )
        );
    }
    test_field_MetricsRenderVertices();
    fn test_field_MetricsRenderIndices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MetricsRenderIndices) as usize - ptr as usize
            },
            224usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MetricsRenderIndices)
            )
        );
    }
    test_field_MetricsRenderIndices();
    fn test_field_MetricsRenderWindows() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MetricsRenderWindows) as usize - ptr as usize
            },
            228usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MetricsRenderWindows)
            )
        );
    }
    test_field_MetricsRenderWindows();
    fn test_field_MetricsActiveWindows() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MetricsActiveWindows) as usize - ptr as usize
            },
            232usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MetricsActiveWindows)
            )
        );
    }
    test_field_MetricsActiveWindows();
    fn test_field_MetricsActiveAllocations() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MetricsActiveAllocations) as usize - ptr as usize
            },
            236usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MetricsActiveAllocations)
            )
        );
    }
    test_field_MetricsActiveAllocations();
    fn test_field_MouseDelta() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDelta) as usize - ptr as usize
            },
            240usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDelta)
            )
        );
    }
    test_field_MouseDelta();
    fn test_field_KeyMap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeyMap) as usize - ptr as usize
            },
            248usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeyMap)
            )
        );
    }
    test_field_KeyMap();
    fn test_field_KeysDown() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeysDown) as usize - ptr as usize
            },
            2828usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeysDown)
            )
        );
    }
    test_field_KeysDown();
    fn test_field_MousePos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MousePos) as usize - ptr as usize
            },
            3476usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MousePos)
            )
        );
    }
    test_field_MousePos();
    fn test_field_MouseDown() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDown) as usize - ptr as usize
            },
            3484usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDown)
            )
        );
    }
    test_field_MouseDown();
    fn test_field_MouseWheel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseWheel) as usize - ptr as usize
            },
            3492usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseWheel)
            )
        );
    }
    test_field_MouseWheel();
    fn test_field_MouseWheelH() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseWheelH) as usize - ptr as usize
            },
            3496usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseWheelH)
            )
        );
    }
    test_field_MouseWheelH();
    fn test_field_MouseHoveredViewport() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseHoveredViewport) as usize - ptr as usize
            },
            3500usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseHoveredViewport)
            )
        );
    }
    test_field_MouseHoveredViewport();
    fn test_field_KeyCtrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeyCtrl) as usize - ptr as usize
            },
            3504usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeyCtrl)
            )
        );
    }
    test_field_KeyCtrl();
    fn test_field_KeyShift() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeyShift) as usize - ptr as usize
            },
            3505usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeyShift)
            )
        );
    }
    test_field_KeyShift();
    fn test_field_KeyAlt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeyAlt) as usize - ptr as usize
            },
            3506usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeyAlt)
            )
        );
    }
    test_field_KeyAlt();
    fn test_field_KeySuper() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeySuper) as usize - ptr as usize
            },
            3507usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeySuper)
            )
        );
    }
    test_field_KeySuper();
    fn test_field_NavInputs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).NavInputs) as usize - ptr as usize
            },
            3508usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(NavInputs)
            )
        );
    }
    test_field_NavInputs();
    fn test_field_KeyMods() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeyMods) as usize - ptr as usize
            },
            3588usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeyMods)
            )
        );
    }
    test_field_KeyMods();
    fn test_field_KeysData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KeysData) as usize - ptr as usize
            },
            3592usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(KeysData)
            )
        );
    }
    test_field_KeysData();
    fn test_field_WantCaptureMouseUnlessPopupClose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).WantCaptureMouseUnlessPopupClose) as usize
                    - ptr as usize
            },
            13912usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(WantCaptureMouseUnlessPopupClose)
            )
        );
    }
    test_field_WantCaptureMouseUnlessPopupClose();
    fn test_field_MousePosPrev() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MousePosPrev) as usize - ptr as usize
            },
            13916usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MousePosPrev)
            )
        );
    }
    test_field_MousePosPrev();
    fn test_field_MouseClickedPos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseClickedPos) as usize - ptr as usize
            },
            13924usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseClickedPos)
            )
        );
    }
    test_field_MouseClickedPos();
    fn test_field_MouseClickedTime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseClickedTime) as usize - ptr as usize
            },
            13968usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseClickedTime)
            )
        );
    }
    test_field_MouseClickedTime();
    fn test_field_MouseClicked() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseClicked) as usize - ptr as usize
            },
            14008usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseClicked)
            )
        );
    }
    test_field_MouseClicked();
    fn test_field_MouseDoubleClicked() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDoubleClicked) as usize - ptr as usize
            },
            14013usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDoubleClicked)
            )
        );
    }
    test_field_MouseDoubleClicked();
    fn test_field_MouseClickedCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseClickedCount) as usize - ptr as usize
            },
            14018usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseClickedCount)
            )
        );
    }
    test_field_MouseClickedCount();
    fn test_field_MouseClickedLastCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseClickedLastCount) as usize - ptr as usize
            },
            14028usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseClickedLastCount)
            )
        );
    }
    test_field_MouseClickedLastCount();
    fn test_field_MouseReleased() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseReleased) as usize - ptr as usize
            },
            14038usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseReleased)
            )
        );
    }
    test_field_MouseReleased();
    fn test_field_MouseDownOwned() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDownOwned) as usize - ptr as usize
            },
            14043usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDownOwned)
            )
        );
    }
    test_field_MouseDownOwned();
    fn test_field_MouseDownOwnedUnlessPopupClose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDownOwnedUnlessPopupClose) as usize - ptr as usize
            },
            14048usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDownOwnedUnlessPopupClose)
            )
        );
    }
    test_field_MouseDownOwnedUnlessPopupClose();
    fn test_field_MouseDownDuration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDownDuration) as usize - ptr as usize
            },
            14056usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDownDuration)
            )
        );
    }
    test_field_MouseDownDuration();
    fn test_field_MouseDownDurationPrev() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDownDurationPrev) as usize - ptr as usize
            },
            14076usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDownDurationPrev)
            )
        );
    }
    test_field_MouseDownDurationPrev();
    fn test_field_MouseDragMaxDistanceAbs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDragMaxDistanceAbs) as usize - ptr as usize
            },
            14096usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDragMaxDistanceAbs)
            )
        );
    }
    test_field_MouseDragMaxDistanceAbs();
    fn test_field_MouseDragMaxDistanceSqr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MouseDragMaxDistanceSqr) as usize - ptr as usize
            },
            14136usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(MouseDragMaxDistanceSqr)
            )
        );
    }
    test_field_MouseDragMaxDistanceSqr();
    fn test_field_NavInputsDownDuration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).NavInputsDownDuration) as usize - ptr as usize
            },
            14156usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(NavInputsDownDuration)
            )
        );
    }
    test_field_NavInputsDownDuration();
    fn test_field_NavInputsDownDurationPrev() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).NavInputsDownDurationPrev) as usize - ptr as usize
            },
            14236usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(NavInputsDownDurationPrev)
            )
        );
    }
    test_field_NavInputsDownDurationPrev();
    fn test_field_PenPressure() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).PenPressure) as usize - ptr as usize
            },
            14316usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(PenPressure)
            )
        );
    }
    test_field_PenPressure();
    fn test_field_AppFocusLost() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AppFocusLost) as usize - ptr as usize
            },
            14320usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(AppFocusLost)
            )
        );
    }
    test_field_AppFocusLost();
    fn test_field_AppAcceptingEvents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AppAcceptingEvents) as usize - ptr as usize
            },
            14321usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(AppAcceptingEvents)
            )
        );
    }
    test_field_AppAcceptingEvents();
    fn test_field_BackendUsingLegacyKeyArrays() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BackendUsingLegacyKeyArrays) as usize - ptr as usize
            },
            14322usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(BackendUsingLegacyKeyArrays)
            )
        );
    }
    test_field_BackendUsingLegacyKeyArrays();
    fn test_field_BackendUsingLegacyNavInputArray() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BackendUsingLegacyNavInputArray) as usize - ptr as usize
            },
            14323usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(BackendUsingLegacyNavInputArray)
            )
        );
    }
    test_field_BackendUsingLegacyNavInputArray();
    fn test_field_InputQueueSurrogate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).InputQueueSurrogate) as usize - ptr as usize
            },
            14324usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(InputQueueSurrogate)
            )
        );
    }
    test_field_InputQueueSurrogate();
    fn test_field_InputQueueCharacters() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiIO>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).InputQueueCharacters) as usize - ptr as usize
            },
            14328usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiIO),
                "::",
                stringify!(InputQueueCharacters)
            )
        );
    }
    test_field_InputQueueCharacters();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiInputTextCallbackData {
    pub EventFlag: ImGuiInputTextFlags,
    pub Flags: ImGuiInputTextFlags,
    pub UserData: *mut ::std::os::raw::c_void,
    pub EventChar: ImWchar,
    pub EventKey: ImGuiKey,
    pub Buf: *mut ::std::os::raw::c_char,
    pub BufTextLen: ::std::os::raw::c_int,
    pub BufSize: ::std::os::raw::c_int,
    pub BufDirty: bool,
    pub CursorPos: ::std::os::raw::c_int,
    pub SelectionStart: ::std::os::raw::c_int,
    pub SelectionEnd: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImGuiInputTextCallbackData() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiInputTextCallbackData>(),
        56usize,
        concat!("Size of: ", stringify!(ImGuiInputTextCallbackData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiInputTextCallbackData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiInputTextCallbackData))
    );
    fn test_field_EventFlag() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EventFlag) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(EventFlag)
            )
        );
    }
    test_field_EventFlag();
    fn test_field_Flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(Flags)
            )
        );
    }
    test_field_Flags();
    fn test_field_UserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UserData) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(UserData)
            )
        );
    }
    test_field_UserData();
    fn test_field_EventChar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EventChar) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(EventChar)
            )
        );
    }
    test_field_EventChar();
    fn test_field_EventKey() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EventKey) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(EventKey)
            )
        );
    }
    test_field_EventKey();
    fn test_field_Buf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(Buf)
            )
        );
    }
    test_field_Buf();
    fn test_field_BufTextLen() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BufTextLen) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(BufTextLen)
            )
        );
    }
    test_field_BufTextLen();
    fn test_field_BufSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BufSize) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(BufSize)
            )
        );
    }
    test_field_BufSize();
    fn test_field_BufDirty() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BufDirty) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(BufDirty)
            )
        );
    }
    test_field_BufDirty();
    fn test_field_CursorPos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CursorPos) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(CursorPos)
            )
        );
    }
    test_field_CursorPos();
    fn test_field_SelectionStart() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SelectionStart) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(SelectionStart)
            )
        );
    }
    test_field_SelectionStart();
    fn test_field_SelectionEnd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiInputTextCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SelectionEnd) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiInputTextCallbackData),
                "::",
                stringify!(SelectionEnd)
            )
        );
    }
    test_field_SelectionEnd();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiSizeCallbackData {
    pub UserData: *mut ::std::os::raw::c_void,
    pub Pos: ImVec2,
    pub CurrentSize: ImVec2,
    pub DesiredSize: ImVec2,
}
#[test]
fn bindgen_test_layout_ImGuiSizeCallbackData() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiSizeCallbackData>(),
        32usize,
        concat!("Size of: ", stringify!(ImGuiSizeCallbackData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiSizeCallbackData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiSizeCallbackData))
    );
    fn test_field_UserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiSizeCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UserData) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiSizeCallbackData),
                "::",
                stringify!(UserData)
            )
        );
    }
    test_field_UserData();
    fn test_field_Pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiSizeCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Pos) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiSizeCallbackData),
                "::",
                stringify!(Pos)
            )
        );
    }
    test_field_Pos();
    fn test_field_CurrentSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiSizeCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CurrentSize) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiSizeCallbackData),
                "::",
                stringify!(CurrentSize)
            )
        );
    }
    test_field_CurrentSize();
    fn test_field_DesiredSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiSizeCallbackData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DesiredSize) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiSizeCallbackData),
                "::",
                stringify!(DesiredSize)
            )
        );
    }
    test_field_DesiredSize();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiWindowClass {
    pub ClassId: ImGuiID,
    pub ParentViewportId: ImGuiID,
    pub ViewportFlagsOverrideSet: ImGuiViewportFlags,
    pub ViewportFlagsOverrideClear: ImGuiViewportFlags,
    pub TabItemFlagsOverrideSet: ImGuiTabItemFlags,
    pub DockNodeFlagsOverrideSet: ImGuiDockNodeFlags,
    pub DockingAlwaysTabBar: bool,
    pub DockingAllowUnclassed: bool,
}
#[test]
fn bindgen_test_layout_ImGuiWindowClass() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiWindowClass>(),
        28usize,
        concat!("Size of: ", stringify!(ImGuiWindowClass))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiWindowClass>(),
        4usize,
        concat!("Alignment of ", stringify!(ImGuiWindowClass))
    );
    fn test_field_ClassId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiWindowClass>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ClassId) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiWindowClass),
                "::",
                stringify!(ClassId)
            )
        );
    }
    test_field_ClassId();
    fn test_field_ParentViewportId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiWindowClass>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ParentViewportId) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiWindowClass),
                "::",
                stringify!(ParentViewportId)
            )
        );
    }
    test_field_ParentViewportId();
    fn test_field_ViewportFlagsOverrideSet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiWindowClass>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ViewportFlagsOverrideSet) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiWindowClass),
                "::",
                stringify!(ViewportFlagsOverrideSet)
            )
        );
    }
    test_field_ViewportFlagsOverrideSet();
    fn test_field_ViewportFlagsOverrideClear() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiWindowClass>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ViewportFlagsOverrideClear) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiWindowClass),
                "::",
                stringify!(ViewportFlagsOverrideClear)
            )
        );
    }
    test_field_ViewportFlagsOverrideClear();
    fn test_field_TabItemFlagsOverrideSet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiWindowClass>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TabItemFlagsOverrideSet) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiWindowClass),
                "::",
                stringify!(TabItemFlagsOverrideSet)
            )
        );
    }
    test_field_TabItemFlagsOverrideSet();
    fn test_field_DockNodeFlagsOverrideSet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiWindowClass>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DockNodeFlagsOverrideSet) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiWindowClass),
                "::",
                stringify!(DockNodeFlagsOverrideSet)
            )
        );
    }
    test_field_DockNodeFlagsOverrideSet();
    fn test_field_DockingAlwaysTabBar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiWindowClass>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DockingAlwaysTabBar) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiWindowClass),
                "::",
                stringify!(DockingAlwaysTabBar)
            )
        );
    }
    test_field_DockingAlwaysTabBar();
    fn test_field_DockingAllowUnclassed() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiWindowClass>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DockingAllowUnclassed) as usize - ptr as usize
            },
            25usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiWindowClass),
                "::",
                stringify!(DockingAllowUnclassed)
            )
        );
    }
    test_field_DockingAllowUnclassed();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiPayload {
    pub Data: *mut ::std::os::raw::c_void,
    pub DataSize: ::std::os::raw::c_int,
    pub SourceId: ImGuiID,
    pub SourceParentId: ImGuiID,
    pub DataFrameCount: ::std::os::raw::c_int,
    pub DataType: [::std::os::raw::c_char; 33usize],
    pub Preview: bool,
    pub Delivery: bool,
}
#[test]
fn bindgen_test_layout_ImGuiPayload() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiPayload>(),
        64usize,
        concat!("Size of: ", stringify!(ImGuiPayload))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiPayload>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiPayload))
    );
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiPayload>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiPayload),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
    fn test_field_DataSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiPayload>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DataSize) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiPayload),
                "::",
                stringify!(DataSize)
            )
        );
    }
    test_field_DataSize();
    fn test_field_SourceId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiPayload>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SourceId) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiPayload),
                "::",
                stringify!(SourceId)
            )
        );
    }
    test_field_SourceId();
    fn test_field_SourceParentId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiPayload>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SourceParentId) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiPayload),
                "::",
                stringify!(SourceParentId)
            )
        );
    }
    test_field_SourceParentId();
    fn test_field_DataFrameCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiPayload>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DataFrameCount) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiPayload),
                "::",
                stringify!(DataFrameCount)
            )
        );
    }
    test_field_DataFrameCount();
    fn test_field_DataType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiPayload>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DataType) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiPayload),
                "::",
                stringify!(DataType)
            )
        );
    }
    test_field_DataType();
    fn test_field_Preview() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiPayload>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Preview) as usize - ptr as usize
            },
            57usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiPayload),
                "::",
                stringify!(Preview)
            )
        );
    }
    test_field_Preview();
    fn test_field_Delivery() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiPayload>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Delivery) as usize - ptr as usize
            },
            58usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiPayload),
                "::",
                stringify!(Delivery)
            )
        );
    }
    test_field_Delivery();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiTableColumnSortSpecs {
    pub ColumnUserID: ImGuiID,
    pub ColumnIndex: ImS16,
    pub SortOrder: ImS16,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_ImGuiTableColumnSortSpecs() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiTableColumnSortSpecs>(),
        12usize,
        concat!("Size of: ", stringify!(ImGuiTableColumnSortSpecs))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiTableColumnSortSpecs>(),
        4usize,
        concat!("Alignment of ", stringify!(ImGuiTableColumnSortSpecs))
    );
    fn test_field_ColumnUserID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTableColumnSortSpecs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ColumnUserID) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTableColumnSortSpecs),
                "::",
                stringify!(ColumnUserID)
            )
        );
    }
    test_field_ColumnUserID();
    fn test_field_ColumnIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTableColumnSortSpecs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ColumnIndex) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTableColumnSortSpecs),
                "::",
                stringify!(ColumnIndex)
            )
        );
    }
    test_field_ColumnIndex();
    fn test_field_SortOrder() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTableColumnSortSpecs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SortOrder) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTableColumnSortSpecs),
                "::",
                stringify!(SortOrder)
            )
        );
    }
    test_field_SortOrder();
}
impl ImGuiTableColumnSortSpecs {
    #[inline]
    pub fn SortDirection(&self) -> ImGuiSortDirection {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_SortDirection(&mut self, val: ImGuiSortDirection) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SortDirection: ImGuiSortDirection,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let SortDirection: u32 = unsafe { ::std::mem::transmute(SortDirection) };
            SortDirection as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiTableSortSpecs {
    pub Specs: *const ImGuiTableColumnSortSpecs,
    pub SpecsCount: ::std::os::raw::c_int,
    pub SpecsDirty: bool,
}
#[test]
fn bindgen_test_layout_ImGuiTableSortSpecs() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiTableSortSpecs>(),
        16usize,
        concat!("Size of: ", stringify!(ImGuiTableSortSpecs))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiTableSortSpecs>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiTableSortSpecs))
    );
    fn test_field_Specs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTableSortSpecs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Specs) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTableSortSpecs),
                "::",
                stringify!(Specs)
            )
        );
    }
    test_field_Specs();
    fn test_field_SpecsCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTableSortSpecs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SpecsCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTableSortSpecs),
                "::",
                stringify!(SpecsCount)
            )
        );
    }
    test_field_SpecsCount();
    fn test_field_SpecsDirty() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTableSortSpecs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SpecsDirty) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTableSortSpecs),
                "::",
                stringify!(SpecsDirty)
            )
        );
    }
    test_field_SpecsDirty();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiOnceUponAFrame {
    pub RefFrame: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImGuiOnceUponAFrame() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiOnceUponAFrame>(),
        4usize,
        concat!("Size of: ", stringify!(ImGuiOnceUponAFrame))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiOnceUponAFrame>(),
        4usize,
        concat!("Alignment of ", stringify!(ImGuiOnceUponAFrame))
    );
    fn test_field_RefFrame() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiOnceUponAFrame>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RefFrame) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiOnceUponAFrame),
                "::",
                stringify!(RefFrame)
            )
        );
    }
    test_field_RefFrame();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiTextRange {
    pub b: *const ::std::os::raw::c_char,
    pub e: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ImGuiTextRange() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiTextRange>(),
        16usize,
        concat!("Size of: ", stringify!(ImGuiTextRange))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiTextRange>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiTextRange))
    );
    fn test_field_b() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTextRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTextRange),
                "::",
                stringify!(b)
            )
        );
    }
    test_field_b();
    fn test_field_e() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTextRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).e) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTextRange),
                "::",
                stringify!(e)
            )
        );
    }
    test_field_e();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiTextRange {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiTextRange,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiTextRange() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiTextRange>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiTextRange))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiTextRange>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiTextRange))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImGuiTextRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImGuiTextRange),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImGuiTextRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImGuiTextRange),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImGuiTextRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImGuiTextRange),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiTextFilter {
    pub InputBuf: [::std::os::raw::c_char; 256usize],
    pub Filters: ImVector_ImGuiTextRange,
    pub CountGrep: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImGuiTextFilter() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiTextFilter>(),
        280usize,
        concat!("Size of: ", stringify!(ImGuiTextFilter))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiTextFilter>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiTextFilter))
    );
    fn test_field_InputBuf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTextFilter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).InputBuf) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTextFilter),
                "::",
                stringify!(InputBuf)
            )
        );
    }
    test_field_InputBuf();
    fn test_field_Filters() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTextFilter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Filters) as usize - ptr as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTextFilter),
                "::",
                stringify!(Filters)
            )
        );
    }
    test_field_Filters();
    fn test_field_CountGrep() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTextFilter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CountGrep) as usize - ptr as usize
            },
            272usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTextFilter),
                "::",
                stringify!(CountGrep)
            )
        );
    }
    test_field_CountGrep();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_char {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ImVector_char() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_char>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_char))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_char>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_char))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_char),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_char),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_char>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_char),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiTextBuffer {
    pub Buf: ImVector_char,
}
#[test]
fn bindgen_test_layout_ImGuiTextBuffer() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiTextBuffer>(),
        16usize,
        concat!("Size of: ", stringify!(ImGuiTextBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiTextBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiTextBuffer))
    );
    fn test_field_Buf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiTextBuffer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiTextBuffer),
                "::",
                stringify!(Buf)
            )
        );
    }
    test_field_Buf();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ImGuiStoragePair {
    pub key: ImGuiID,
    pub __bindgen_anon_1: ImGuiStoragePair__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ImGuiStoragePair__bindgen_ty_1 {
    pub val_i: ::std::os::raw::c_int,
    pub val_f: f32,
    pub val_p: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ImGuiStoragePair__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiStoragePair__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ImGuiStoragePair__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiStoragePair__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiStoragePair__bindgen_ty_1))
    );
    fn test_field_val_i() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStoragePair__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).val_i) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStoragePair__bindgen_ty_1),
                "::",
                stringify!(val_i)
            )
        );
    }
    test_field_val_i();
    fn test_field_val_f() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStoragePair__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).val_f) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStoragePair__bindgen_ty_1),
                "::",
                stringify!(val_f)
            )
        );
    }
    test_field_val_f();
    fn test_field_val_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStoragePair__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).val_p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStoragePair__bindgen_ty_1),
                "::",
                stringify!(val_p)
            )
        );
    }
    test_field_val_p();
}
#[test]
fn bindgen_test_layout_ImGuiStoragePair() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiStoragePair>(),
        16usize,
        concat!("Size of: ", stringify!(ImGuiStoragePair))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiStoragePair>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiStoragePair))
    );
    fn test_field_key() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStoragePair>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStoragePair),
                "::",
                stringify!(key)
            )
        );
    }
    test_field_key();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiStoragePair {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiStoragePair,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiStoragePair() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiStoragePair>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiStoragePair))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiStoragePair>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiStoragePair))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImGuiStoragePair>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImGuiStoragePair),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImGuiStoragePair>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImGuiStoragePair),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImGuiStoragePair>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImGuiStoragePair),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiStorage {
    pub Data: ImVector_ImGuiStoragePair,
}
#[test]
fn bindgen_test_layout_ImGuiStorage() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiStorage>(),
        16usize,
        concat!("Size of: ", stringify!(ImGuiStorage))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiStorage>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiStorage))
    );
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiStorage>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiStorage),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiListClipper {
    pub DisplayStart: ::std::os::raw::c_int,
    pub DisplayEnd: ::std::os::raw::c_int,
    pub ItemsCount: ::std::os::raw::c_int,
    pub ItemsHeight: f32,
    pub StartPosY: f32,
    pub TempData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ImGuiListClipper() {
    assert_eq!(
        ::std::mem::size_of::<ImGuiListClipper>(),
        32usize,
        concat!("Size of: ", stringify!(ImGuiListClipper))
    );
    assert_eq!(
        ::std::mem::align_of::<ImGuiListClipper>(),
        8usize,
        concat!("Alignment of ", stringify!(ImGuiListClipper))
    );
    fn test_field_DisplayStart() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiListClipper>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisplayStart) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiListClipper),
                "::",
                stringify!(DisplayStart)
            )
        );
    }
    test_field_DisplayStart();
    fn test_field_DisplayEnd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiListClipper>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisplayEnd) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiListClipper),
                "::",
                stringify!(DisplayEnd)
            )
        );
    }
    test_field_DisplayEnd();
    fn test_field_ItemsCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiListClipper>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ItemsCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiListClipper),
                "::",
                stringify!(ItemsCount)
            )
        );
    }
    test_field_ItemsCount();
    fn test_field_ItemsHeight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiListClipper>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ItemsHeight) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiListClipper),
                "::",
                stringify!(ItemsHeight)
            )
        );
    }
    test_field_ItemsHeight();
    fn test_field_StartPosY() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiListClipper>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).StartPosY) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiListClipper),
                "::",
                stringify!(StartPosY)
            )
        );
    }
    test_field_StartPosY();
    fn test_field_TempData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImGuiListClipper>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TempData) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImGuiListClipper),
                "::",
                stringify!(TempData)
            )
        );
    }
    test_field_TempData();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImColor {
    pub Value: ImVec4,
}
#[test]
fn bindgen_test_layout_ImColor() {
    assert_eq!(
        ::std::mem::size_of::<ImColor>(),
        16usize,
        concat!("Size of: ", stringify!(ImColor))
    );
    assert_eq!(
        ::std::mem::align_of::<ImColor>(),
        4usize,
        concat!("Alignment of ", stringify!(ImColor))
    );
    fn test_field_Value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImColor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Value) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImColor),
                "::",
                stringify!(Value)
            )
        );
    }
    test_field_Value();
}
pub type ImDrawCallback = ::std::option::Option<
    unsafe extern "C" fn(parent_list: *const ImDrawList, cmd: *const ImDrawCmd),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImDrawCmd {
    pub ClipRect: ImVec4,
    pub TextureId: ImTextureID,
    pub VtxOffset: ::std::os::raw::c_uint,
    pub IdxOffset: ::std::os::raw::c_uint,
    pub ElemCount: ::std::os::raw::c_uint,
    pub UserCallback: ImDrawCallback,
    pub UserCallbackData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ImDrawCmd() {
    assert_eq!(
        ::std::mem::size_of::<ImDrawCmd>(),
        56usize,
        concat!("Size of: ", stringify!(ImDrawCmd))
    );
    assert_eq!(
        ::std::mem::align_of::<ImDrawCmd>(),
        8usize,
        concat!("Alignment of ", stringify!(ImDrawCmd))
    );
    fn test_field_ClipRect() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ClipRect) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmd),
                "::",
                stringify!(ClipRect)
            )
        );
    }
    test_field_ClipRect();
    fn test_field_TextureId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TextureId) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmd),
                "::",
                stringify!(TextureId)
            )
        );
    }
    test_field_TextureId();
    fn test_field_VtxOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VtxOffset) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmd),
                "::",
                stringify!(VtxOffset)
            )
        );
    }
    test_field_VtxOffset();
    fn test_field_IdxOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IdxOffset) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmd),
                "::",
                stringify!(IdxOffset)
            )
        );
    }
    test_field_IdxOffset();
    fn test_field_ElemCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ElemCount) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmd),
                "::",
                stringify!(ElemCount)
            )
        );
    }
    test_field_ElemCount();
    fn test_field_UserCallback() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UserCallback) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmd),
                "::",
                stringify!(UserCallback)
            )
        );
    }
    test_field_UserCallback();
    fn test_field_UserCallbackData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UserCallbackData) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmd),
                "::",
                stringify!(UserCallbackData)
            )
        );
    }
    test_field_UserCallbackData();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImDrawVert {
    pub pos: ImVec2,
    pub uv: ImVec2,
    pub col: ImU32,
}
#[test]
fn bindgen_test_layout_ImDrawVert() {
    assert_eq!(
        ::std::mem::size_of::<ImDrawVert>(),
        20usize,
        concat!("Size of: ", stringify!(ImDrawVert))
    );
    assert_eq!(
        ::std::mem::align_of::<ImDrawVert>(),
        4usize,
        concat!("Alignment of ", stringify!(ImDrawVert))
    );
    fn test_field_pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawVert>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawVert),
                "::",
                stringify!(pos)
            )
        );
    }
    test_field_pos();
    fn test_field_uv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawVert>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).uv) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawVert),
                "::",
                stringify!(uv)
            )
        );
    }
    test_field_uv();
    fn test_field_col() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawVert>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).col) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawVert),
                "::",
                stringify!(col)
            )
        );
    }
    test_field_col();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImDrawCmdHeader {
    pub ClipRect: ImVec4,
    pub TextureId: ImTextureID,
    pub VtxOffset: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ImDrawCmdHeader() {
    assert_eq!(
        ::std::mem::size_of::<ImDrawCmdHeader>(),
        32usize,
        concat!("Size of: ", stringify!(ImDrawCmdHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<ImDrawCmdHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(ImDrawCmdHeader))
    );
    fn test_field_ClipRect() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmdHeader>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ClipRect) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmdHeader),
                "::",
                stringify!(ClipRect)
            )
        );
    }
    test_field_ClipRect();
    fn test_field_TextureId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmdHeader>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TextureId) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmdHeader),
                "::",
                stringify!(TextureId)
            )
        );
    }
    test_field_TextureId();
    fn test_field_VtxOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawCmdHeader>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VtxOffset) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawCmdHeader),
                "::",
                stringify!(VtxOffset)
            )
        );
    }
    test_field_VtxOffset();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImDrawCmd {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImDrawCmd,
}
#[test]
fn bindgen_test_layout_ImVector_ImDrawCmd() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImDrawCmd>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImDrawCmd))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImDrawCmd>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImDrawCmd))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawCmd),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawCmd),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawCmd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawCmd),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImDrawIdx {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImDrawIdx,
}
#[test]
fn bindgen_test_layout_ImVector_ImDrawIdx() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImDrawIdx>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImDrawIdx))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImDrawIdx>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImDrawIdx))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawIdx>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawIdx),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawIdx>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawIdx),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawIdx>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawIdx),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImDrawChannel {
    pub _CmdBuffer: ImVector_ImDrawCmd,
    pub _IdxBuffer: ImVector_ImDrawIdx,
}
#[test]
fn bindgen_test_layout_ImDrawChannel() {
    assert_eq!(
        ::std::mem::size_of::<ImDrawChannel>(),
        32usize,
        concat!("Size of: ", stringify!(ImDrawChannel))
    );
    assert_eq!(
        ::std::mem::align_of::<ImDrawChannel>(),
        8usize,
        concat!("Alignment of ", stringify!(ImDrawChannel))
    );
    fn test_field__CmdBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawChannel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._CmdBuffer) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawChannel),
                "::",
                stringify!(_CmdBuffer)
            )
        );
    }
    test_field__CmdBuffer();
    fn test_field__IdxBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawChannel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IdxBuffer) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawChannel),
                "::",
                stringify!(_IdxBuffer)
            )
        );
    }
    test_field__IdxBuffer();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImDrawChannel {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImDrawChannel,
}
#[test]
fn bindgen_test_layout_ImVector_ImDrawChannel() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImDrawChannel>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImDrawChannel))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImDrawChannel>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImDrawChannel))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawChannel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawChannel),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawChannel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawChannel),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawChannel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawChannel),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImDrawListSplitter {
    pub _Current: ::std::os::raw::c_int,
    pub _Count: ::std::os::raw::c_int,
    pub _Channels: ImVector_ImDrawChannel,
}
#[test]
fn bindgen_test_layout_ImDrawListSplitter() {
    assert_eq!(
        ::std::mem::size_of::<ImDrawListSplitter>(),
        24usize,
        concat!("Size of: ", stringify!(ImDrawListSplitter))
    );
    assert_eq!(
        ::std::mem::align_of::<ImDrawListSplitter>(),
        8usize,
        concat!("Alignment of ", stringify!(ImDrawListSplitter))
    );
    fn test_field__Current() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawListSplitter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Current) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawListSplitter),
                "::",
                stringify!(_Current)
            )
        );
    }
    test_field__Current();
    fn test_field__Count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawListSplitter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Count) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawListSplitter),
                "::",
                stringify!(_Count)
            )
        );
    }
    test_field__Count();
    fn test_field__Channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawListSplitter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Channels) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawListSplitter),
                "::",
                stringify!(_Channels)
            )
        );
    }
    test_field__Channels();
}
pub const ImDrawFlags__ImDrawFlags_None: ImDrawFlags_ = 0;
pub const ImDrawFlags__ImDrawFlags_Closed: ImDrawFlags_ = 1;
pub const ImDrawFlags__ImDrawFlags_RoundCornersTopLeft: ImDrawFlags_ = 16;
pub const ImDrawFlags__ImDrawFlags_RoundCornersTopRight: ImDrawFlags_ = 32;
pub const ImDrawFlags__ImDrawFlags_RoundCornersBottomLeft: ImDrawFlags_ = 64;
pub const ImDrawFlags__ImDrawFlags_RoundCornersBottomRight: ImDrawFlags_ = 128;
pub const ImDrawFlags__ImDrawFlags_RoundCornersNone: ImDrawFlags_ = 256;
pub const ImDrawFlags__ImDrawFlags_RoundCornersTop: ImDrawFlags_ = 48;
pub const ImDrawFlags__ImDrawFlags_RoundCornersBottom: ImDrawFlags_ = 192;
pub const ImDrawFlags__ImDrawFlags_RoundCornersLeft: ImDrawFlags_ = 80;
pub const ImDrawFlags__ImDrawFlags_RoundCornersRight: ImDrawFlags_ = 160;
pub const ImDrawFlags__ImDrawFlags_RoundCornersAll: ImDrawFlags_ = 240;
pub const ImDrawFlags__ImDrawFlags_RoundCornersDefault_: ImDrawFlags_ = 240;
pub const ImDrawFlags__ImDrawFlags_RoundCornersMask_: ImDrawFlags_ = 496;
pub type ImDrawFlags_ = ::std::os::raw::c_int;
pub const ImDrawListFlags__ImDrawListFlags_None: ImDrawListFlags_ = 0;
pub const ImDrawListFlags__ImDrawListFlags_AntiAliasedLines: ImDrawListFlags_ = 1;
pub const ImDrawListFlags__ImDrawListFlags_AntiAliasedLinesUseTex: ImDrawListFlags_ = 2;
pub const ImDrawListFlags__ImDrawListFlags_AntiAliasedFill: ImDrawListFlags_ = 4;
pub const ImDrawListFlags__ImDrawListFlags_AllowVtxOffset: ImDrawListFlags_ = 8;
pub type ImDrawListFlags_ = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImDrawVert {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImDrawVert,
}
#[test]
fn bindgen_test_layout_ImVector_ImDrawVert() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImDrawVert>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImDrawVert))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImDrawVert>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImDrawVert))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawVert>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawVert),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawVert>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawVert),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImDrawVert>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImDrawVert),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImVec4 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImVec4,
}
#[test]
fn bindgen_test_layout_ImVector_ImVec4() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImVec4>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImVec4))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImVec4>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImVec4))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImVec4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImVec4),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImVec4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImVec4),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImVec4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImVec4),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImTextureID {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImTextureID,
}
#[test]
fn bindgen_test_layout_ImVector_ImTextureID() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImTextureID>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImTextureID))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImTextureID>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImTextureID))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImTextureID>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImTextureID),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImTextureID>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImTextureID),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImTextureID>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImTextureID),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImVec2 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImVec2,
}
#[test]
fn bindgen_test_layout_ImVector_ImVec2() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImVec2>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImVec2))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImVec2>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImVec2))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImVec2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImVec2),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImVec2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImVec2),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImVec2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImVec2),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImDrawList {
    pub CmdBuffer: ImVector_ImDrawCmd,
    pub IdxBuffer: ImVector_ImDrawIdx,
    pub VtxBuffer: ImVector_ImDrawVert,
    pub Flags: ImDrawListFlags,
    pub _VtxCurrentIdx: ::std::os::raw::c_uint,
    pub _Data: *const ImDrawListSharedData,
    pub _OwnerName: *const ::std::os::raw::c_char,
    pub _VtxWritePtr: *mut ImDrawVert,
    pub _IdxWritePtr: *mut ImDrawIdx,
    pub _ClipRectStack: ImVector_ImVec4,
    pub _TextureIdStack: ImVector_ImTextureID,
    pub _Path: ImVector_ImVec2,
    pub _CmdHeader: ImDrawCmdHeader,
    pub _Splitter: ImDrawListSplitter,
    pub _FringeScale: f32,
}
#[test]
fn bindgen_test_layout_ImDrawList() {
    assert_eq!(
        ::std::mem::size_of::<ImDrawList>(),
        200usize,
        concat!("Size of: ", stringify!(ImDrawList))
    );
    assert_eq!(
        ::std::mem::align_of::<ImDrawList>(),
        8usize,
        concat!("Alignment of ", stringify!(ImDrawList))
    );
    fn test_field_CmdBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CmdBuffer) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(CmdBuffer)
            )
        );
    }
    test_field_CmdBuffer();
    fn test_field_IdxBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IdxBuffer) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(IdxBuffer)
            )
        );
    }
    test_field_IdxBuffer();
    fn test_field_VtxBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VtxBuffer) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(VtxBuffer)
            )
        );
    }
    test_field_VtxBuffer();
    fn test_field_Flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(Flags)
            )
        );
    }
    test_field_Flags();
    fn test_field__VtxCurrentIdx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._VtxCurrentIdx) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_VtxCurrentIdx)
            )
        );
    }
    test_field__VtxCurrentIdx();
    fn test_field__Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Data) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_Data)
            )
        );
    }
    test_field__Data();
    fn test_field__OwnerName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._OwnerName) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_OwnerName)
            )
        );
    }
    test_field__OwnerName();
    fn test_field__VtxWritePtr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._VtxWritePtr) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_VtxWritePtr)
            )
        );
    }
    test_field__VtxWritePtr();
    fn test_field__IdxWritePtr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IdxWritePtr) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_IdxWritePtr)
            )
        );
    }
    test_field__IdxWritePtr();
    fn test_field__ClipRectStack() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._ClipRectStack) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_ClipRectStack)
            )
        );
    }
    test_field__ClipRectStack();
    fn test_field__TextureIdStack() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._TextureIdStack) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_TextureIdStack)
            )
        );
    }
    test_field__TextureIdStack();
    fn test_field__Path() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Path) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_Path)
            )
        );
    }
    test_field__Path();
    fn test_field__CmdHeader() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._CmdHeader) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_CmdHeader)
            )
        );
    }
    test_field__CmdHeader();
    fn test_field__Splitter() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Splitter) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_Splitter)
            )
        );
    }
    test_field__Splitter();
    fn test_field__FringeScale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._FringeScale) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawList),
                "::",
                stringify!(_FringeScale)
            )
        );
    }
    test_field__FringeScale();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImDrawData {
    pub Valid: bool,
    pub CmdListsCount: ::std::os::raw::c_int,
    pub TotalIdxCount: ::std::os::raw::c_int,
    pub TotalVtxCount: ::std::os::raw::c_int,
    pub CmdLists: *mut *mut ImDrawList,
    pub DisplayPos: ImVec2,
    pub DisplaySize: ImVec2,
    pub FramebufferScale: ImVec2,
    pub OwnerViewport: *mut ImGuiViewport,
}
#[test]
fn bindgen_test_layout_ImDrawData() {
    assert_eq!(
        ::std::mem::size_of::<ImDrawData>(),
        56usize,
        concat!("Size of: ", stringify!(ImDrawData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImDrawData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImDrawData))
    );
    fn test_field_Valid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Valid) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawData),
                "::",
                stringify!(Valid)
            )
        );
    }
    test_field_Valid();
    fn test_field_CmdListsCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CmdListsCount) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawData),
                "::",
                stringify!(CmdListsCount)
            )
        );
    }
    test_field_CmdListsCount();
    fn test_field_TotalIdxCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TotalIdxCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawData),
                "::",
                stringify!(TotalIdxCount)
            )
        );
    }
    test_field_TotalIdxCount();
    fn test_field_TotalVtxCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TotalVtxCount) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawData),
                "::",
                stringify!(TotalVtxCount)
            )
        );
    }
    test_field_TotalVtxCount();
    fn test_field_CmdLists() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CmdLists) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawData),
                "::",
                stringify!(CmdLists)
            )
        );
    }
    test_field_CmdLists();
    fn test_field_DisplayPos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisplayPos) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawData),
                "::",
                stringify!(DisplayPos)
            )
        );
    }
    test_field_DisplayPos();
    fn test_field_DisplaySize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisplaySize) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawData),
                "::",
                stringify!(DisplaySize)
            )
        );
    }
    test_field_DisplaySize();
    fn test_field_FramebufferScale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FramebufferScale) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawData),
                "::",
                stringify!(FramebufferScale)
            )
        );
    }
    test_field_FramebufferScale();
    fn test_field_OwnerViewport() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImDrawData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).OwnerViewport) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ImDrawData),
                "::",
                stringify!(OwnerViewport)
            )
        );
    }
    test_field_OwnerViewport();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImFontConfig {
    pub FontData: *mut ::std::os::raw::c_void,
    pub FontDataSize: ::std::os::raw::c_int,
    pub FontDataOwnedByAtlas: bool,
    pub FontNo: ::std::os::raw::c_int,
    pub SizePixels: f32,
    pub OversampleH: ::std::os::raw::c_int,
    pub OversampleV: ::std::os::raw::c_int,
    pub PixelSnapH: bool,
    pub GlyphExtraSpacing: ImVec2,
    pub GlyphOffset: ImVec2,
    pub GlyphRanges: *const ImWchar,
    pub GlyphMinAdvanceX: f32,
    pub GlyphMaxAdvanceX: f32,
    pub MergeMode: bool,
    pub FontBuilderFlags: ::std::os::raw::c_uint,
    pub RasterizerMultiply: f32,
    pub EllipsisChar: ImWchar,
    pub Name: [::std::os::raw::c_char; 40usize],
    pub DstFont: *mut ImFont,
}
#[test]
fn bindgen_test_layout_ImFontConfig() {
    assert_eq!(
        ::std::mem::size_of::<ImFontConfig>(),
        136usize,
        concat!("Size of: ", stringify!(ImFontConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<ImFontConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(ImFontConfig))
    );
    fn test_field_FontData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FontData) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(FontData)
            )
        );
    }
    test_field_FontData();
    fn test_field_FontDataSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FontDataSize) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(FontDataSize)
            )
        );
    }
    test_field_FontDataSize();
    fn test_field_FontDataOwnedByAtlas() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FontDataOwnedByAtlas) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(FontDataOwnedByAtlas)
            )
        );
    }
    test_field_FontDataOwnedByAtlas();
    fn test_field_FontNo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FontNo) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(FontNo)
            )
        );
    }
    test_field_FontNo();
    fn test_field_SizePixels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SizePixels) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(SizePixels)
            )
        );
    }
    test_field_SizePixels();
    fn test_field_OversampleH() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).OversampleH) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(OversampleH)
            )
        );
    }
    test_field_OversampleH();
    fn test_field_OversampleV() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).OversampleV) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(OversampleV)
            )
        );
    }
    test_field_OversampleV();
    fn test_field_PixelSnapH() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).PixelSnapH) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(PixelSnapH)
            )
        );
    }
    test_field_PixelSnapH();
    fn test_field_GlyphExtraSpacing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GlyphExtraSpacing) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(GlyphExtraSpacing)
            )
        );
    }
    test_field_GlyphExtraSpacing();
    fn test_field_GlyphOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GlyphOffset) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(GlyphOffset)
            )
        );
    }
    test_field_GlyphOffset();
    fn test_field_GlyphRanges() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GlyphRanges) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(GlyphRanges)
            )
        );
    }
    test_field_GlyphRanges();
    fn test_field_GlyphMinAdvanceX() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GlyphMinAdvanceX) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(GlyphMinAdvanceX)
            )
        );
    }
    test_field_GlyphMinAdvanceX();
    fn test_field_GlyphMaxAdvanceX() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GlyphMaxAdvanceX) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(GlyphMaxAdvanceX)
            )
        );
    }
    test_field_GlyphMaxAdvanceX();
    fn test_field_MergeMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MergeMode) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(MergeMode)
            )
        );
    }
    test_field_MergeMode();
    fn test_field_FontBuilderFlags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FontBuilderFlags) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(FontBuilderFlags)
            )
        );
    }
    test_field_FontBuilderFlags();
    fn test_field_RasterizerMultiply() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RasterizerMultiply) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(RasterizerMultiply)
            )
        );
    }
    test_field_RasterizerMultiply();
    fn test_field_EllipsisChar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EllipsisChar) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(EllipsisChar)
            )
        );
    }
    test_field_EllipsisChar();
    fn test_field_Name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize
            },
            86usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(Name)
            )
        );
    }
    test_field_Name();
    fn test_field_DstFont() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DstFont) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontConfig),
                "::",
                stringify!(DstFont)
            )
        );
    }
    test_field_DstFont();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImFontGlyph {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub AdvanceX: f32,
    pub X0: f32,
    pub Y0: f32,
    pub X1: f32,
    pub Y1: f32,
    pub U0: f32,
    pub V0: f32,
    pub U1: f32,
    pub V1: f32,
}
#[test]
fn bindgen_test_layout_ImFontGlyph() {
    assert_eq!(
        ::std::mem::size_of::<ImFontGlyph>(),
        40usize,
        concat!("Size of: ", stringify!(ImFontGlyph))
    );
    assert_eq!(
        ::std::mem::align_of::<ImFontGlyph>(),
        4usize,
        concat!("Alignment of ", stringify!(ImFontGlyph))
    );
    fn test_field_AdvanceX() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyph>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AdvanceX) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyph),
                "::",
                stringify!(AdvanceX)
            )
        );
    }
    test_field_AdvanceX();
    fn test_field_X0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyph>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).X0) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyph),
                "::",
                stringify!(X0)
            )
        );
    }
    test_field_X0();
    fn test_field_Y0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyph>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Y0) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyph),
                "::",
                stringify!(Y0)
            )
        );
    }
    test_field_Y0();
    fn test_field_X1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyph>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).X1) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyph),
                "::",
                stringify!(X1)
            )
        );
    }
    test_field_X1();
    fn test_field_Y1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyph>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Y1) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyph),
                "::",
                stringify!(Y1)
            )
        );
    }
    test_field_Y1();
    fn test_field_U0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyph>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).U0) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyph),
                "::",
                stringify!(U0)
            )
        );
    }
    test_field_U0();
    fn test_field_V0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyph>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).V0) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyph),
                "::",
                stringify!(V0)
            )
        );
    }
    test_field_V0();
    fn test_field_U1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyph>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).U1) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyph),
                "::",
                stringify!(U1)
            )
        );
    }
    test_field_U1();
    fn test_field_V1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyph>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).V1) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyph),
                "::",
                stringify!(V1)
            )
        );
    }
    test_field_V1();
}
impl ImFontGlyph {
    #[inline]
    pub fn Colored(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Colored(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Visible(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Visible(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Codepoint(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_Codepoint(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Colored: ::std::os::raw::c_uint,
        Visible: ::std::os::raw::c_uint,
        Codepoint: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let Colored: u32 = unsafe { ::std::mem::transmute(Colored) };
            Colored as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let Visible: u32 = unsafe { ::std::mem::transmute(Visible) };
            Visible as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let Codepoint: u32 = unsafe { ::std::mem::transmute(Codepoint) };
            Codepoint as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImU32 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImU32,
}
#[test]
fn bindgen_test_layout_ImVector_ImU32() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImU32>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImU32))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImU32>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImU32))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImU32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImU32),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImU32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImU32),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImU32>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImU32),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImFontGlyphRangesBuilder {
    pub UsedChars: ImVector_ImU32,
}
#[test]
fn bindgen_test_layout_ImFontGlyphRangesBuilder() {
    assert_eq!(
        ::std::mem::size_of::<ImFontGlyphRangesBuilder>(),
        16usize,
        concat!("Size of: ", stringify!(ImFontGlyphRangesBuilder))
    );
    assert_eq!(
        ::std::mem::align_of::<ImFontGlyphRangesBuilder>(),
        8usize,
        concat!("Alignment of ", stringify!(ImFontGlyphRangesBuilder))
    );
    fn test_field_UsedChars() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontGlyphRangesBuilder>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UsedChars) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontGlyphRangesBuilder),
                "::",
                stringify!(UsedChars)
            )
        );
    }
    test_field_UsedChars();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImFontAtlasCustomRect {
    pub Width: ::std::os::raw::c_ushort,
    pub Height: ::std::os::raw::c_ushort,
    pub X: ::std::os::raw::c_ushort,
    pub Y: ::std::os::raw::c_ushort,
    pub GlyphID: ::std::os::raw::c_uint,
    pub GlyphAdvanceX: f32,
    pub GlyphOffset: ImVec2,
    pub Font: *mut ImFont,
}
#[test]
fn bindgen_test_layout_ImFontAtlasCustomRect() {
    assert_eq!(
        ::std::mem::size_of::<ImFontAtlasCustomRect>(),
        32usize,
        concat!("Size of: ", stringify!(ImFontAtlasCustomRect))
    );
    assert_eq!(
        ::std::mem::align_of::<ImFontAtlasCustomRect>(),
        8usize,
        concat!("Alignment of ", stringify!(ImFontAtlasCustomRect))
    );
    fn test_field_Width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Width) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlasCustomRect),
                "::",
                stringify!(Width)
            )
        );
    }
    test_field_Width();
    fn test_field_Height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Height) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlasCustomRect),
                "::",
                stringify!(Height)
            )
        );
    }
    test_field_Height();
    fn test_field_X() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).X) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlasCustomRect),
                "::",
                stringify!(X)
            )
        );
    }
    test_field_X();
    fn test_field_Y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Y) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlasCustomRect),
                "::",
                stringify!(Y)
            )
        );
    }
    test_field_Y();
    fn test_field_GlyphID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GlyphID) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlasCustomRect),
                "::",
                stringify!(GlyphID)
            )
        );
    }
    test_field_GlyphID();
    fn test_field_GlyphAdvanceX() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GlyphAdvanceX) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlasCustomRect),
                "::",
                stringify!(GlyphAdvanceX)
            )
        );
    }
    test_field_GlyphAdvanceX();
    fn test_field_GlyphOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GlyphOffset) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlasCustomRect),
                "::",
                stringify!(GlyphOffset)
            )
        );
    }
    test_field_GlyphOffset();
    fn test_field_Font() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Font) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlasCustomRect),
                "::",
                stringify!(Font)
            )
        );
    }
    test_field_Font();
}
pub const ImFontAtlasFlags__ImFontAtlasFlags_None: ImFontAtlasFlags_ = 0;
pub const ImFontAtlasFlags__ImFontAtlasFlags_NoPowerOfTwoHeight: ImFontAtlasFlags_ = 1;
pub const ImFontAtlasFlags__ImFontAtlasFlags_NoMouseCursors: ImFontAtlasFlags_ = 2;
pub const ImFontAtlasFlags__ImFontAtlasFlags_NoBakedLines: ImFontAtlasFlags_ = 4;
pub type ImFontAtlasFlags_ = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImFontPtr {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut *mut ImFont,
}
#[test]
fn bindgen_test_layout_ImVector_ImFontPtr() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImFontPtr>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImFontPtr))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImFontPtr>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImFontPtr))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImFontPtr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImFontPtr),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImFontPtr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImFontPtr),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImFontPtr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImFontPtr),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImFontAtlasCustomRect {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImFontAtlasCustomRect,
}
#[test]
fn bindgen_test_layout_ImVector_ImFontAtlasCustomRect() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImFontAtlasCustomRect>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImFontAtlasCustomRect))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImFontAtlasCustomRect>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImFontAtlasCustomRect))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImFontAtlasCustomRect),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImFontAtlasCustomRect),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImFontAtlasCustomRect>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImFontAtlasCustomRect),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImFontConfig {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImFontConfig,
}
#[test]
fn bindgen_test_layout_ImVector_ImFontConfig() {
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImFontConfig>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImFontConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImFontConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImFontConfig))
    );
    fn test_field_Size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImFontConfig),
                "::",
                stringify!(Size)
            )
        );
    }
    test_field_Size();
    fn test_field_Capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImFontConfig),
                "::",
                stringify!(Capacity)
            )
        );
    }
    test_field_Capacity();
    fn test_field_Data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImVector_ImFontConfig>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImVector_ImFontConfig),
                "::",
                stringify!(Data)
            )
        );
    }
    test_field_Data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImFontAtlas {
    pub Flags: ImFontAtlasFlags,
    pub TexID: ImTextureID,
    pub TexDesiredWidth: ::std::os::raw::c_int,
    pub TexGlyphPadding: ::std::os::raw::c_int,
    pub Locked: bool,
    pub TexReady: bool,
    pub TexPixelsUseColors: bool,
    pub TexPixelsAlpha8: *mut ::std::os::raw::c_uchar,
    pub TexPixelsRGBA32: *mut ::std::os::raw::c_uint,
    pub TexWidth: ::std::os::raw::c_int,
    pub TexHeight: ::std::os::raw::c_int,
    pub TexUvScale: ImVec2,
    pub TexUvWhitePixel: ImVec2,
    pub Fonts: ImVector_ImFontPtr,
    pub CustomRects: ImVector_ImFontAtlasCustomRect,
    pub ConfigData: ImVector_ImFontConfig,
    pub TexUvLines: [ImVec4; 64usize],
    pub FontBuilderIO: *const ImFontBuilderIO,
    pub FontBuilderFlags: ::std::os::raw::c_uint,
    pub PackIdMouseCursors: ::std::os::raw::c_int,
    pub PackIdLines: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImFontAtlas() {
    assert_eq!(
        ::std::mem::size_of::<ImFontAtlas>(),
        1168usize,
        concat!("Size of: ", stringify!(ImFontAtlas))
    );
    assert_eq!(
        ::std::mem::align_of::<ImFontAtlas>(),
        8usize,
        concat!("Alignment of ", stringify!(ImFontAtlas))
    );
    fn test_field_Flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlas>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlas),
                "::",
                stringify!(Flags)
            )
        );
    }
    test_field_Flags();
    fn test_field_TexID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlas>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TexID) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlas),
                "::",
                stringify!(TexID)
            )
        );
    }
    test_field_TexID();
    fn test_field_TexDesiredWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlas>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TexDesiredWidth) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlas),
                "::",
                stringify!(TexDesiredWidth)
            )
        );
    }
    test_field_TexDesiredWidth();
    fn test_field_TexGlyphPadding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlas>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TexGlyphPadding) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlas),
                "::",
                stringify!(TexGlyphPadding)
            )
        );
    }
    test_field_TexGlyphPadding();
    fn test_field_Locked() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlas>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Locked) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlas),
                "::",
                stringify!(Locked)
            )
        );
    }
    test_field_Locked();
    fn test_field_TexReady() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlas>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TexReady) as usize - ptr as usize
            },
            25usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlas),
                "::",
                stringify!(TexReady)
            )
        );
    }
    test_field_TexReady();
    fn test_field_TexPixelsUseColors() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImFontAtlas>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TexPixelsUseColors) as usize - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(ImFontAtlas),
                "::",
                stringify!(TexPixelsUseColors)
            )
        );
    }
    test_field_TexPixelsUseColors();
    fn test_field_TexPixelsAlpha8() {
        assert_eq!(
            unsafe {
